{
  "isBlog": true,
  "meta": {
    "title": "ustwo - blog"
  },
  "extraHead": "<link rel=\"alternate\" type=\"application/rss+xml\" title=\"ustwo &raquo; Blog Comments Feed\" href=\"http://ustwo.com/blog/feed/\" />\n<link rel='stylesheet' id='wp-pagenavi-css'  href='http://ustwo.com/wordpress/wp-content/plugins/wp-pagenavi/pagenavi-css.css?ver=2.70' type='text/css' media='all' />\n<link rel=\"EditURI\" type=\"application/rsd+xml\" title=\"RSD\" href=\"http://ustwo.com/wordpress/xmlrpc.php?rsd\" />\n<link rel=\"wlwmanifest\" type=\"application/wlwmanifest+xml\" href=\"http://ustwo.com/wordpress/wp-includes/wlwmanifest.xml\" /> \n<link rel='shortlink' href='http://ustwo.com/?p=5840' />\n\t<style type=\"text/css\">.recentcomments a{display:inline !important;padding:0 !important;margin:0 !important;}</style>\n\n<!-- All in One SEO Pack 2.2.2 by Michael Torbert of Semper Fi Web Designob_start_detected [-1,-1] -->\n<link rel=\"canonical\" href=\"http://ustwo.com/blog/\" />\n<!-- /all in one seo pack -->\n",
  "urls": {
    "site": "http://ustwo.com",
    "cdn": "http://cdn.ustwo.com",
    "page": "/blog/",
    "full": "http://ustwo.com/blog/",
    "theme": "http://ustwo.com/wordpress/wp-content/themes/ustwo.com-wp",
    "ajax": "http://ustwo.com/wordpress/wp-content/themes/ustwo.com-wp/ajax",
    "css": "http://ustwo.com/wordpress/wp-content/themes/ustwo.com-wp/css",
    "js": "http://ustwo.com/wordpress/wp-content/themes/ustwo.com-wp/js",
    "images": "http://ustwo.com/wordpress/wp-content/themes/ustwo.com-wp/images"
  },
  "category": "all",
  "posts": {
    "items": [
      {
        "id": 7780,
        "title": "INTERFACE EVOLUTION – FROM APPS TO CONTEXT",
        "excerpt": "Current interfaces are the reflection of the outer brand-centric world. Most of the functionality is branded — we google, skype and tweet. Is this the pinnacle of the interface evolution?",
        "content": "<p>Current interfaces are the reflection of the outer brand-centric world. A grid of logomarked rectangles, displayed on the main screen like small billboards. Most of the functionality is branded — we don’t search, talk and write thoughts, instead we google, skype and tweet. Is this the crown of the interface evolution?</p>\n<h3>Short Historical Excursion</h3>\n<p>Things haven&#8217;t changed much since the introduction of graphical user interface replacing the obsolete command line. The application-centric interface — the successor of the document-centric model — didn’t make interfaces simpler. It added a cognitive layer, as you have to learn first what application is used for each task. This way, instead of selecting a picture and have an edit functionality suggested, you need to remember what certain application you should use, load it up and open the picture in that app.</p>\n<p>The task-centric interface inspired by web design practices didn’t succeed in solving the problem described above. Oversimplification and too many steps even for the simplest tasks made it suitable only for specific scenarios.</p>\n<p>A mix of document-, app-, and task-centric interfaces is the status quo.</p>\n<h3>Coming full circle</h3>\n<p>The next step of the interface evolution, not surprisingly, also comes from the web. We use it every day when we search for information. Though it’s called the &#8216;search box&#8217;, the name is deceitful. It’s not just search, it’s also capable of executing simple commands, conversions and calculations.</p>\n<p><img class=\"alignnone size-full wp-image-7788\" src=\"http://ustwo.com/wordpress/wp-content/uploads/1984/03/ui_evolution2.png\" alt=\"The evolution of UI\" width=\"860\" height=\"286\" /></p>\n<p>You can appreciate the irony, seeing interface history turn a full circle and return to the starting point. The simple search engine’s text box can be viewed as the zenith of the command line. A command line that doesn’t care for word order or spelling, and that understands commands in natural language. But it would not realise its true potential without the capacity for learning and awareness.</p>\n<p>While we were all focused on the superficial changes, like touchscreens making the direct manipulation of GUI even more &#8216;direct&#8217;, the revolution happened in the backend. It wasn’t a particular technology, but the synergy of various sensors, dedicated processors and advanced algorithms. The simple artificial intelligence was born. The context becomes as important as content – location and spatial position awareness, the ability to access and analyse simultaneously a variety of sources from weather to calendar allows it to react correspondingly to the user input.</p>\n<p>The personified digital &#8216;interlocutor&#8217; interface for the AI was chosen because of its wow-factor, sci-fi feel and our human tendency to anthropomorphise things. But from the outside it looks like Siri and its equivalents are just a voice interface to the hidden powerful command line. What if it wasn’t hidden and we had a text interface to interact with the AI for situations when the use of voice is impossible or socially unacceptable? For example the current iPhone’s Spotlight search screen could become something far bigger than dumb search. As the user starts typing there seems to be little difference from the current Spotlight search. As the user enters further text and symbols, the search results collapse and disappear, revealing intuitive suggestions of possible actions. </p>\n<p><strong>Scenario 1:</strong></p>\n<p><strong><img class=\"alignnone size-full wp-image-7782\" src=\"http://ustwo.com/wordpress/wp-content/uploads/2015/03/text_siri_pic1.png\" alt=\"concept piece for Siri\" width=\"860\" height=\"1708\" /></strong><br /><strong>Scenario 2:</strong></p>\n<p><img class=\"alignnone size-full wp-image-7783\" src=\"http://ustwo.com/wordpress/wp-content/uploads/2015/03/text_siri_pic2.png\" alt=\"concept piece for Siri\" width=\"860\" height=\"1708\" /></p>\n<p>In both visualised scenarios (the visualisations are just a proof of concept) numbers are entered, one turning out to be a contact number and other a message. The closest implementation of such interface was &#8216;Just Type&#8217; on the ill-fated Palm OS and unfortunately there is no current equivalent.</p>\n<h3>Interface dissolves in intelligence</h3>\n<p>Sony sells fewer and fewer point-and-shoot cameras each year, but more and more image sensors for smartphones. Dedicated devices are being replaced by a single converged device and the single-task device manufacturers become chip suppliers for smartphones.</p>\n<p>Continuing the theme, the evolution of intelligent software agents will put an end to the over-glorification of the separated apps and functions. The latter will be hidden under the centralised content/context-centric interface in the same way as Siri currently hides Yelp!, Google, Wikipedia, Wolfram Alpha and many other services. Apps will become APIs.</p>\n<p>Instead of prioritising applications or tasks, the new UI will put the user input (content, gestures, voice commands etc) and the context of it (location, weather, traffic conditions etc) first. The &#8216;choose application — input content&#8217; model will evolve to just &#8216;input content&#8217; as smart algorithms based on the context, your preferences and prior usage will do the rest.</p>\n<p>To paraphrase the famous <a href=\"http://www.naotofukasawa.com/\" target=\"_blank\">Naoto Fukasawa</a>’s quote about design – <strong>the interface will dissolve in intelligence</strong>.</p>\n",
        "date": "12 March 2015",
        "link": "/blog/from-app-centric-to-content-and-context-centric/",
        "category": "Design",
        "thumbnail": "http://ustwo.com/wordpress/wp-content/uploads/1984/03/ui_evolution2.png",
        "author": {
          "name": "Eugeniu",
          "avatar": "<img alt='' src='http://1.gravatar.com/avatar/9e370532d91b590b86dcf32ce571e960?s=110&amp;d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D110&amp;r=X' class='avatar avatar-110 photo' height='110' width='110' />",
          "description": "Eugeniu Clim is an icon/interface designer at ustwo, always in search of the ideal icon motif or interface layout. You can follow him on Twitter @pickuniquename."
        },
        "comments": {
          "items": [],
          "count": 0
        },
        "social": {
          "tweets": "13",
          "facebook": "12",
          "plus": "1",
          "total": 26
        },
        "layout": {
          "categoryClass": "design"
        },
        "extraClasses": ""
      },
      {
        "id": 7291,
        "title": "ustwo Reimagines the In-Car Cluster",
        "excerpt": "The ustwo auto team takes a fresh look at the instrument cluster on a dashboard and imagines how it could look in the car of the near future. ",
        "content": "<p>It’s been a few months since our five-part blog and <a href=\"http://cdn.ustwo.com/automotive/AreWeThereYet_V1.0.pdf\" target=\"_blank\">ebook</a> was released and we&#8217;re delighted with all the responses and feedback generated. In the time since, we’ve put some of our theories and learning into practice in this thought-piece, with a prototype and design assets ready for you to download and play with. We hope you enjoy reading this as much as we&#8217;ve enjoyed writing it.</p>\n<h3><strong>TL;DR Summary</strong></h3>\n<p>Over the last year we’ve seen a lot of new thought about in-car HMI. We’ve seen considered critique about the elements and design considerations (especially in the centre console), with safety rightly at the forefront. There were 10 automakers at CES this year, with 50 products designed to reduce accidents.</p>\n<p>In the course of our research and partnership with CDR (<a href=\"http://cardesignresearch.com/en\" target=\"_blank\">Car Design Research</a>), we identified one fundamental and ubiquitous element in cars which has lacked an effective redesign over the last few decades.</p>\n<p>This element is the humble <strong>instrument cluster,</strong> with its speedometer and fuel gauge and so on. We’ve looked into how we can and why we should enrich this space. We want to present the results of this, not as a complete solution, but as a viewpoint and approach to be tested, debated and improved with <strong>your feedback</strong>.</p>\n<p><img class=\"aligncenter size-full wp-image-7632\" src=\"http://ustwo.com/wordpress/wp-content/uploads/2015/02/collage2.png\" alt=\"collage\" width=\"1073\" height=\"362\" /></p>\n<p>The instrument cluster as a feedback element has remained fundamentally unchanged since instruments first appeared in cars. Even today with LCD clusters, such as in the Mercedes S-Class, we see the skeuomorphic recreation of these mechanical dials in digital form. There are some good reasons for this, such as consistency, familiarity, brand perception and so on but we feel this ought to be challenged.</p>\n<h3><strong>Our Hypothesis</strong></h3>\n<p>By looking afresh at the instrument cluster, and applying modern contexts and technology to the problem, we believe that we can make better use of the screen real estate by clearly showing the right information at the right time.<strong><strong> </strong></strong></p>\n<p>With this contextual empathy in place, we can then increase situational awareness for the driver – when passing a school during collection time, in adverse weather conditions, accidents, road works, a slippery road and so on.</p>\n<p>As a result of this, we may be able to provide better and more timely information, reduce driver distractions and therefore accidents. We would like to achieve all of this and still retain the positive aspects of the analogue approach – the ability to show relative information, a consistent design paradigm, and to confer a level of quality and reinforcement of the brand.</p>\n<p>In order to test this hypothesis, we needed to design and build on our ideas. ustwo has an open and product-centric approach, which meant we were able to quickly design and build prototypes to test and iterate upon.</p>\n<p>Here we present the results of this process, through a thought piece along with an explanatory video and interactive prototypes providing finer details.</p>\n<h3><strong>Video Demo</strong></h3>\n<p>Before we go to the prototypes, here&#8217;s our concept in a nutshell. </p>\n<p><iframe src=\"//player.vimeo.com/video/119123983\" width=\"860\" height=\"480\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"></iframe></p>\n<h3><strong>Prototypes</strong></h3>\n<p>We&#8217;ve also built a prototype of a non-branded archetype of the cluster below. It&#8217;s <strong>interactive</strong>, so try it out and see what you think. If you&#8217;d like to develop and improve it more, download the source code and design assets from our <a title=\"Autocluster github\" href=\"https://github.com/ustwo/autocluster\" target=\"_blank\">github page</a>.</p>\n<p><strong><strong><iframe src=\"http://trials.wormholevision.org/\" width=\"909\" height=\"410\" frameborder=\"0\"></iframe></strong></strong></p>\n<p>The unbranded prototype above forms the basis of the concept and underlying principles – it is agnostic to the form and shape of the technological medium. The screen, as a medium, can be quite different in shape, due to easing of manufacturing constraints. This can be seen in the <a href=\"http://www.theverge.com/2015/1/7/7511317/sharp-free-form-display-nintendo-ces-2015\" target=\"_blank\">Sharp Free-form displays</a>, for example.</p>\n<p>Here are a couple of interactive examples of how our concept could be branded to work inside an actual vehicle, within different form factors. Press the button below the image (<em>&#8216;Press to speed up&#8217;</em>).</p>\n<p><iframe src=\"http://trialsferrari.wormholevision.org/\" width=\"1281\" height=\"720\" frameborder=\"0\"></iframe><em><em><strong>Above: </strong></em>Branded to the Ferrari California, with circular displays (The GT defaults to automatic control, where we see the rev counter being less important. In a manual scenario, of course the rev counter displaces the speedometer in priority)</em></p>\n<p><iframe src=\"http://trialsmerc.wormholevision.org/\" width=\"1281\" height=\"720\" frameborder=\"0\"></iframe><em><em><strong>Above: </strong></em>Branded to the Mercedes S-Class whose rectangular screen was our benchmark</em></p>\n<h3><strong> </strong></h3>\n<h3><strong>The Full Story</strong></h3>\n<h4>What made us look again at this ubiquitous feedback element?</h4>\n<p>The instrument cluster seen today as a collection of gauges and indicators is among the earliest forms of feedback systems on an automobile dashboard. Their functional evolution has been a result of safety regulations (speedometer), considerations of efficiency (e.g. tachometer/rev counter) and at times due to plain practical considerations while using a car (fuel gauge/odometer).</p>\n<p><img class=\"aligncenter size-full wp-image-7391\" src=\"http://ustwo.com/wordpress/wp-content/uploads/2015/02/dialvsspeedo.png\" alt=\"dialvsspeedo\" width=\"1224\" height=\"390\" /><em><em><strong>Above: </strong></em>Early dials vs present dials (Smiths odometer 1920 vs 2013 Honda CRV)</em></p>\n<p>As covered in <a href=\"http://www.ustwo.com/auto\" target=\"_blank\">our ebook</a>, although the mechanics are no longer used, the same method to communicate velocity is still adopted in nearly all cars. Is a dial pointing at a number really the most effective way of doing this?</p>\n<p>There is a lot of legacy thinking with the cluster. Most of the primary feedback considerations have remained unchanged for decades.</p>\n<p>We wanted to take a deeper look at it, and what we discuss next is a critical examination leading to the re-imagination of a standard cluster in a car with automatic transmission.</p>\n<p>Having a broad look at the present clusters we can see a trend where manufacturers are moving towards having screen-based feedback systems. Here, for example, we see the cluster of a Mercedes S-Class saloon. At first glance, it is beautifully crafted and the screen seems an obvious and logical choice.</p>\n<p><img class=\"aligncenter size-full wp-image-7392\" src=\"http://ustwo.com/wordpress/wp-content/uploads/2015/02/mercdash.png\" alt=\"mercdash\" width=\"1434\" height=\"987\" /></p>\n<p>Screens present a rich visual medium for displaying data, they reduce costs when compared to mechanical elements and also make the entire cluster modular and easy to repair and replace.</p>\n<p>But it is a prime example of what we call <a href=\"http://ustwo.com/blog/changing-patterns-in-hmi/\" target=\"_blank\"><strong>stylistic skeuomorphism</strong></a> – in this case, a HD display is being used to mimic traditional mechanical dial faces. We see this as a place where technology should be used as a material, and where design is not being used to its true potential.</p>\n<p>We can easily ask the following questions of it:</p>\n<p><strong>1. Is the screen’s real estate being used appropriately</strong>? <br />Is a dial the best form of displaying glanceable and understandable information, or is it an anachronism?<br /><strong><br />2. Does it offer</strong> <strong>contextual empathy and appropriateness?</strong> <br />Location, speed limits etc. can easily be obtained from present day cars and the mobile devices people carry.<br /><strong><br />3. Why are clusters so feature-rich, but context-poor?<br /></strong>Contextual representation of data can also reduce clutter in the display, if only the most appropriate bits of data are shown to a driver (reducing distraction). Also, what do all the dials signify or mean for an everyday driver (i.e. how important is the rev counter, other than for sports or faux-sports cars)? What is the simplest, most easily understood representation of important in-car information? Where is data about fuel capacity most relevant, while driving or while stopped?<br /><strong><br />4. Can a screen for the cluster be used to reduce dependence on other interfaces?<br /></strong>For instance, a centre console or even an HUD (where information density is critical)?</p>\n<p>We don’t advocate using technology for technology’s sake. As mentioned in our ebook, we are aware of the argument that analogue dials signifies a relative position – akin to ‘How many minutes to 2 o’clock? – as seen with traditional watch-faces. We’d like, however, to make the argument that there are now new and more relevant measures such as ‘how close to the speed limit am I driving?’</p>\n<p>In our design process we tried to take strong elements from this traditional, familiar representation and marry them with learned behaviours and new signifiers relevant for the now in order to create a pleasurable and meaningful experience for users.</p>\n<h4>Key elements and design principles in the concept</h4>\n<p><em>OR – an answer to the question: What is the simplest, most easily understood representation of key information in a cluster, without being tied down by legacy and history as discussed earlier?</em></p>\n<p>We have broken away from the <strong>traditional singular notions of quantified feedback </strong>(e.g. fuel capacity) and have introduced other elements alongside them, <strong>enriching the quantity with contextuality</strong> (e.g. fuel capacity is combined with known mileage of a vehicle, based on previous driving behaviour, to estimate a range).</p>\n<p><strong>What elements of a traditional cluster should we design for? What can be left out?</strong> This was a really important question, and for clarity’s sake we chose the following elements to be shown in our cluster design. Certain elements have been deliberately left behind, considering legacy and context, we focused only on the necessary.</p>\n<p><strong>Key elements </strong></p>\n<ul>\n<li><strong>Speed:</strong> Speed shown in relation to the local speed limits and other parameters, such as weather, with appropriate feedback</li>\n<li><strong>Range status:</strong> Combining elements of a fuel gauge and range shown both as absolutes and in relation to the next journey</li>\n<li><strong>Contextual alerts:</strong> Both based on location, time (school zone, slippery roads, traffic conditions) and where the alert originates from, for instance HUD (above) or centre console (left in the UK)</li>\n<li><strong>Reverse:</strong> Rear-view camera takes over screen while reversing</li>\n<li><strong>Gears: </strong>Consistently positioned and present at all times as is the legal requirement</li>\n</ul>\n<p>We also devised five key design principles which we used to inform and validate all of our design decisions. Each are based on our experience with designing for the in-car environment and includes considerations such as safety, accessibility, increasing glance-ability and reducing driver distraction:</p>\n<p><strong>Key design principles</strong></p>\n<p><strong>1.</strong> Adaptive hierarchy, agnostic to display<br /><strong>2.</strong> Insight, not just raw data<br /><strong>3.</strong> Designing visual feedback by thinking in time<br /><strong>4.</strong> Understand the contextual relationships of elements<br /><strong>5.</strong> Considered visual design</p>\n<h3><strong>1. Adaptive hierarchy of elements based on action and user behaviour, agnostic to display</strong></h3>\n<p>The layout of the design adapts, affording priority for elements based on the user’s action at any point to display just the right information at just the right time. This form of contextual empathy might allow users to be connected to both the HMI and the real world.</p>\n<p>For instance the speedometer only shows itself while the car moves, and is minimised when not, allowing us to focus on more important details while not in motion, like range to your destination or fuel status.</p>\n<p><img class=\"aligncenter size-full wp-image-7755\" src=\"http://ustwo.com/wordpress/wp-content/uploads/2015/03/concept_driverangehigh.png\" alt=\"concept_driverangehigh\" width=\"1440\" height=\"550\" /><em><em><strong>Above: </strong></em>while driving, speed takes top priority, while range (to the right) is secondary information</em></p>\n<p><img class=\"aligncenter size-full wp-image-7756\" src=\"http://ustwo.com/wordpress/wp-content/uploads/2015/03/concept_parked.png\" alt=\"concept_parked\" width=\"1440\" height=\"550\" /><img class=\"aligncenter size-full wp-image-7757\" src=\"http://ustwo.com/wordpress/wp-content/uploads/2015/03/concept_parked_low.png\" alt=\"concept_parked_low\" width=\"1440\" height=\"550\" /><em><em><strong>Above: </strong></em>when parked, there is no need for the speedometer so range takes priority instead</em></p>\n<p><img class=\"aligncenter size-full wp-image-7397\" src=\"http://ustwo.com/wordpress/wp-content/uploads/2015/02/xy.jpg\" alt=\"xy\" width=\"924\" height=\"353\" /><em><em><strong>Above: </strong></em>how our concept utilises two of three dimensions</em><strong><strong> </strong></strong></p>\n<p>To accompany this concept, we derived an X, Y, Z axis system layout. The Y axis is the dimension in which the data is communicated. Coloured bars increase and decrease up and down this axis to represent speed and range. Low on the Y axis is low speed or range.</p>\n<p>The X axis is used to categorise and prioritise types of information and is dynamic and adaptive to the context. The categories include the speedometer, the range gauge, the gears and rear camera when reversing. One or more of these are displayed depending on the driving situation and increase and decrease in width depending on their importance at any given moment. This forms the essence of Adaptive Hierarchy.</p>\n<p><strong><strong><img class=\"aligncenter size-full wp-image-7755\" src=\"http://ustwo.com/wordpress/wp-content/uploads/2015/03/concept_driverangehigh.png\" alt=\"concept_driverangehigh\" width=\"1440\" height=\"550\" /><img class=\"aligncenter size-full wp-image-7759\" src=\"http://ustwo.com/wordpress/wp-content/uploads/2015/03/concept_driverangelow.png\" alt=\"concept_driverangelow\" width=\"1440\" height=\"550\" /></strong></strong></p>\n<p><em><em><strong>Above: </strong></em>the range indicator has increased in width because the range is low and a refuel is recommended. The increase in width brings it to the driver’s attention</em></p>\n<p><img class=\"aligncenter size-full wp-image-7771\" src=\"http://ustwo.com/wordpress/wp-content/uploads/2015/03/layers1.png\" alt=\"layers\" width=\"1592\" height=\"1042\" /><em><strong>Above:</strong> The Z axis, or depth, represents context of what is displayed.</em></p>\n<p>The <strong>bottom layer</strong> is the background, and acts as the metric meter.</p>\n<p>The layer above, the <strong>middle layer</strong>, shows the actual information or metric, mapped to the metric meter beneath it.</p>\n<p>The <strong>top layer</strong> houses new and additional information where something new has been introduced, for example if a slippery road warning has been triggered or a text message has been received.<strong><strong> </strong></strong></p>\n<p><strong><strong><img class=\"aligncenter size-full wp-image-7760\" src=\"http://ustwo.com/wordpress/wp-content/uploads/2015/03/concept_driveinfo.png\" alt=\"concept_driveinfo\" width=\"1440\" height=\"550\" /></strong></strong></p>\n<p><em><em><strong>Above: </strong></em>the top layer on the Z axis shows newly occurring information, such as a slippery road warning</em></p>\n<p>This layer also orientates the information from where it is delivered, i.e. an icon representing a change in road condition transitions from the road ahead into the top of the screen, where as a text message notification transitions from the centre console to the left of the screen (UK). This contextual-physical orientation helps the user understand its meaning. The top layer is the only layer that is actionable and is therefore the only layer that is not consistent throughout the drive.</p>\n<p>This layout has a number of benefits in addition to providing the information described above. The full-block colour dynamic ensures the information is understandable if part of it is obstructed by the steering wheel or drivers arms when turning.</p>\n<h3><strong>2. Insights through visualisations, not just raw data</strong><strong><strong> </strong></strong></h3>\n<p>We shied away from using pure numerical outputs, and use visualisations where we can. Doing this helps create elements which can be understood quickly without excessive interpretation and cognitive load. The notion of range, replacing that of fuel status, is displayed explicitly – i.e. rather than “you have this much fuel/energy”, we use “this is how far I can go with the amount of fuel/energy I have”. The range indicator reduces with fuel consumption and is always seen in the context of the next journey the user undertakes.</p>\n<h3><strong>3. Designing visual feedback by thinking in time</strong></h3>\n<h4>Macro-dwell</h4>\n<p>Living with a piece of design is a very different thing to a first experience. Like any relationship, the more you get to know it, the more you understand it, and once you do the design can evolve with it. Design needn’t be static.</p>\n<p>Certain labels can reduce in scale after a few drives – MPH, for example, or colours could dim as the day turns to night.</p>\n<p><img class=\"aligncenter size-full wp-image-7402\" src=\"http://ustwo.com/wordpress/wp-content/uploads/2015/02/mph.png\" alt=\"mph\" width=\"1224\" height=\"606\" /><em><em><strong>Above: </strong></em>during first time use or first drive in an MPH zone (left), the ‘MPH’ label could be prominent, but after several drives, when it is understood, this label could recede (right), minimising clutter and distraction</em></p>\n<p>The interface could adapt to the time of week or even year. This will of course need to be done appropriately, with safety at the forefront of any design decision –you don’t want to change the design too much mid-drive for example. There’s a lot of potential in this idea and it’s one we’d like to explore further.</p>\n<h4>Micro-dwell and motion principles</h4>\n<p>For the instances where we look at the ‘present’ experience, by using a combination of change in colour, and subtle changes using animation, we can provide information in the shortest of looks, or even provoke a glance when required.</p>\n<p>We look to two types of animation:</p>\n<p><strong>Discreet:</strong> changes in layout and modes.</p>\n<p><strong>Attract:</strong> alerts and notifications that are designed to grab the driver’s attention. Breaching the speed limit, for example, is represented via instant changes in colour to the speedometer, provoking a glance whereas a speed recommendation in case of wet roads, is a gradation over color, with subtle animation.</p>\n<p><strong><strong><img class=\"aligncenter size-full wp-image-7403\" src=\"http://ustwo.com/wordpress/wp-content/uploads/2015/02/alerts.gif\" alt=\"alerts\" width=\"1224\" height=\"468\" /></strong></strong></p>\n<p><em><em><strong>Above: </strong></em>speeding animation attracts (left) while speed recommendation (right) is discreet</em></p>\n<h3><strong>4. Understand the contextual relationships of elements</strong></h3>\n<p>We felt that the best way to bring together concepts of visualising data and designing in time was by adding an extra layer of contextual relationships.</p>\n<p>The speedometer acts both to visualise data, with the rectangle changing height or colour and also operates with respect to the speed limits on the road you are driving.</p>\n<p><img class=\"aligncenter size-full wp-image-7761\" src=\"http://ustwo.com/wordpress/wp-content/uploads/2015/03/concept_drivespeeding02.png\" alt=\"concept_drivespeeding02\" width=\"1440\" height=\"550\" /><em><em><strong>Above: </strong></em>red indicates you are driving over the speed limit</em></p>\n<p>Here, the speed limit is 70 mph, and the top of the screen represents 70, while the bottom represents 0. As the bar raises beyond the top of the screen, i.e. over the speed limit, the colour changes accordingly.</p>\n<h3><strong>5. Considered design – both beauty and the brains</strong></h3>\n<p>Human Machine Interface (HMI) is a relationship between the driver and the car. When talking about designing for in-car interactions, it’s worth remembering that this relationship goes two ways – the car can communicate with the driver, just as the driver communicates to the car.</p>\n<p>This relationship, however, is not necessarily monogamous. The driver could vary and be of any gender, age, height etc. This plays in to the dynamic nature and strengths of digital technology. We consider these varying factors because ultimately we want to distract as little as possible &#8211; the design should minimise ‘dwell’ times, or to use a trending phrase, improve ‘glance-ability’ no matter who the driver is. Better glance-ability means less time with the driver’s eyes off the road, less cognition, less distraction and ultimately, less risk of an accident.</p>\n<p>To achieve this glance-able design, we researched and studied each of these design elements to come up with the most considered visual design:</p>\n<ul>\n<li><strong>Typography</strong></li>\n<li><strong>Scale and Visual Angle</strong></li>\n<li><strong>Colour</strong></li>\n<li><strong>Visual language &amp; Iconography</strong></li>\n<li><strong>Layout</strong></li>\n<li><strong>Branding</strong></li>\n<li><strong>Design in time</strong></li>\n</ul>\n<h4>Typography</h4>\n<p>A font is a fundamental element of design, and most user interfaces. A good font is both beautiful and functional, it <em>demonstrates</em> style and identity while it also <em>performs</em> function and communication.</p>\n<p>Fonts therefore have a dual responsibility within the car. The branded and couture nature of the automobile demands a strong identity and attractive aesthetic, while in safety critical UIs such as those found in the car, the font must communicate any given message or data element as quickly as possible, minimising risk of a road accident.</p>\n<p>We didn’t have time to develop our own font (as much as we’d like to) but we can leverage the work of those who have …</p>\n<p>Traditionally, automotive manufacturers have opted for a square grotesque font, the assumption being that they were chosen for their uniformity, openness and “tech” feel.</p>\n<p><img class=\"aligncenter size-full wp-image-7406\" src=\"http://ustwo.com/wordpress/wp-content/uploads/2015/02/volvo-concept-estate_41.jpg\" alt=\"Volvo Concept Estate interior details\" width=\"1280\" height=\"832\" /><em><em><strong>Above: </strong></em>Volvo Concept Estate</em></p>\n<p>However, according to research carried out by The Massachusetts Institute of Technology (MIT) AgeLab and the New England University Transportation Centre along with Monotype, square grotesque fonts increase dwell time by 12% over humanist fonts, which gives a 50-foot braking distance discrepancy in the car when driving at average speed (<a href=\"https://www.youtube.com/watch?v=BMP5cuAYG_Q\" target=\"_blank\">source video</a>). That 50 feet can mean the difference between safe driving and a serious accident.</p>\n<p><a href=\"http://www.monotype.com/\" target=\"_blank\">Monotype</a> suggests a humanist font (sans-serif typefaces with oval shapes and variations in stroke thickness to create a more human appearance). Not only is a humanist font quicker to read, thanks to the echo of the handwritten form (hence the term humanist), but it also does away with the sci-fi, masculine aesthetic of the square grotesque fonts in favour of something more … well, human. See Monotype&#8217;s list of recommended humanist fonts for the in-car environment <a href=\"http://www.monotype.com/services/font-design/fonts/hmi-fonts-latin\" target=\"_blank\">here</a>.</p>\n<p>When deciding on a font to use for our concept, we drafted the following criteria:</p>\n<ul>\n<li><strong>Humanist:</strong> Varying stroke widths that mimic handwriting, large apertures (this helps to avoid confusing an ‘e’ for an ‘o’ or vice versa) and X heights make a humanist font quicker to read, reducing the time the driver has their eyes off the road.</li>\n<li><strong>Many weights: </strong>Many weights allowed us to test the most legible strength of a font.</li>\n<li><strong>Completeness of glyphs:</strong> A full set of glyphs ensures that a plethora of data and metrics can be communicated in as broad a range of languages as possible.</li>\n<li><strong>Friendly:</strong> Friendliness serves a function, it makes the font easier to read while also helping to get away from the techy, daunting aesthetic of many in-car HMI’s.</li>\n</ul>\n<p>For our concept, we chose Roboto, as it met all of our criteria while also having the benefit of being tested in-car by Google.</p>\n<blockquote><p><em>the team tested Roboto for the car, using LCD shutters that testers wear like sunglasses, and which force the wearer to look at a UI in only glance-able fragments—just like you would in a car sporting Android.</em></p>\n</blockquote>\n<p>We had the luxury, however, of having no brand guidelines to conform to (more on that later). We could write a whole separate blog piece on typography for cars alone (watch this space), but in the meantime we’d recommend <a href=\"http://go.monotype.com/Whitepapers.html\" target=\"_blank\">this excellent piece</a> by MIT &amp; Monotype.</p>\n<p>What we’ve described above covers off the “intrinsic factors” of a font, those design features which inform the font itself (such as line thickness and apertures). “Extrinsic factors” of the font, such as its scale, colour etc. must also be taken into consideration.</p>\n<h4>Scale and Visual angle</h4>\n<p>The scale of characters, alphanumerics, icons and any graphic that communicates is extremely important. Scale can make a piece of text legible, it can give a brochure a sense of hierarchy to lead the reader through the page in the intended order, it can even evoke an emotion in an animation. When it comes to the in-car environment, however, scale takes on a whole new set of characteristics.</p>\n<p>The size of fonts for example should not necessarily be measured in points or pixels, but instead should fall within the optimal range, or what is known as “visual angle”, for any given driver.</p>\n<p><img class=\"aligncenter size-full wp-image-7585\" src=\"http://ustwo.com/wordpress/wp-content/uploads/2015/02/Visual-Angle3.jpg\" alt=\"Visual-Angle\" width=\"1010\" height=\"428\" /></p>\n<p>It’s far too complicated a mechanic to discuss here (<a href=\"http://en.wikipedia.org/wiki/Visual_angle\" target=\"_blank\">read this</a> for more information), but we can describe it with a simple analogy:</p>\n<p>Imagine being in the cinema. You’re sitting in the front row because you think that’s the best seat in the house. However, you realise quite quickly that you’re so close that you can’t see the whole screen at once, you actually have to move your head around as the action unfolds. The visual angle is far too obtuse.</p>\n<p><img class=\"aligncenter size-full wp-image-7408\" src=\"http://ustwo.com/wordpress/wp-content/uploads/2015/02/cinema.jpg\" alt=\"cinema\" width=\"1010\" height=\"359\" /></p>\n<p>If you were to sit in the middle row however, the visual angle would be far less severe and you’d be able to see the whole screen at once. Now, sit back and enjoy Prometheus because it’s brilliant – don’t listen to what other people say.</p>\n<p>You see, when it comes to typefaces or icons etc, it’s easy to think “the bigger the better” – the more legible it is, but as is evident in the analogy above, you can have too big (obtuse), just like you can have too small (acute) – it needs to be just right, somewhere in the middle.</p>\n<p>In our concept we tried to use an appropriate visual angle for the type and iconography as is recommended in <a href=\"http://www.regulations.gov/contentStreamer?objectId=0900006480ff6aac&amp;disposition=attachment&amp;contentType=pdf\" target=\"_blank\">this study (PDF download 244kb)</a> by Rochester Institute of Technology Research and Monotype. What’s interesting is that different drivers will be further or closer to the screen than others, digital displays allows us to customise the scale of type and icons so that they fall within the specific drivers optimal visual angle, another advantage of the digital over the mechanical.</p>\n<p>To demonstrate <strong>adaptive UI based on an ergonomic visual angle</strong>, driver/seat position in the context of the car, we built a quick prototype based on a JS head-tracking algorithm <a href=\"http://trials3.wormholevision.org/\" target=\"_blank\">here</a> (the prototype needs access to your camera and please use the Chrome browser on your desktop for the best performance).</p>\n<p>As you can see, the text size and vertical position in the speedometer, reacts to proximity with the camera (z-axis) and to your height (y-axis). Of course, the text size and position will be set as the driver enters the car, and will not change throughout the drive.</p>\n<p>We can posit that with face-tracking cameras and algorithms already used in cars/trucks (tracking eyelids for symptoms of drowsiness for <a href=\"http://www.wired.co.uk/news/archive/2013-05/28/eye-tracking-mining-system\" target=\"_blank\">example</a>) could be further repurposed to suit interfaces like the cluster in the near future.</p>\n<p><img class=\"aligncenter size-full wp-image-7409\" src=\"http://ustwo.com/wordpress/wp-content/uploads/2015/02/clustergrab1080.gif\" alt=\"clustergrab1080\" width=\"933\" height=\"305\" /></p>\n<p><em><strong>Above:</strong> You can have a go yourself <a href=\"http://trials3.wormholevision.org/\" target=\"_blank\">here</a> (the prototype needs access to your camera, please use the Chrome browser on your desktop for the best performance)</em></p>\n<h4>Colour</h4>\n<p>Colour is arguably the single most important thing in design. You can have a beautifully designed website until you turn everything white and then you can’t see jack. A digital display is made up of thousands of pixels and each has just one job – show a colour. All those colours team up and together display anything you want, like a well-organised show of support at a sporting event.</p>\n<p><img class=\"aligncenter size-full wp-image-7410\" src=\"http://ustwo.com/wordpress/wp-content/uploads/2015/02/mosaicsomunequip.jpg\" alt=\"LLIGA DE CAMPIONS - 1/8 TORNADA - FC BARCELONA - AC MILAN\" width=\"2048\" height=\"1152\" /></p>\n<p>And this is exactly how we approached the design of our concept; each pixel must serve a purpose, without exception. In fact this is how we approach every project at ustwo. To our earlier point, if you make everything white, you don’t have anything at all, so contrast is of paramount importance, but that’s nothing new, so let’s focus on things of note in our concept.</p>\n<p>When it came to deciding what colours to give each pixel, and with the luxury of not having a brand to design for, we turned to what is already familiar – familiarity after all is a powerful conveyor of meaning.</p>\n<p>ISO are the international standard of symbols and tell-tales in the vehicle and they govern all the icons and tell tales in your car. This is how they inform the colours used in the information displays in your car:</p>\n<blockquote><p><em>5.1 When used on optical indicators or tell-tales, the following colours have the meanings indicated:</em><em><br /></em><em><strong>- red:</strong> danger to persons or very serious damage to equipment, immediate or imminent;</em><em><br /></em><em><strong>- yellow or amber:</strong> caution, outside normal operating limits, vehicle system malfunction, damage to vehicle likely, or other condition which may produce hazard in the longer term;</em><em><br /></em><em><strong>- green:</strong> safe, normal operating condition (where blue or yellow is not required).</em></p>\n</blockquote>\n<p>As you can see from our concept, we have taken these on board. We use amber when the driver is driving at 0-10% higher than the speed limit (an allowance which is considered when policing driving speeds) and red when the driver is over the limit by more than 10%. Similarly, green is used when the range is adequate to get to your destination, and we use amber when it is low.</p>\n<p><img class=\"aligncenter size-full wp-image-7411\" src=\"http://ustwo.com/wordpress/wp-content/uploads/2015/02/speeding.png\" alt=\"speeding\" width=\"1224\" height=\"400\" /></p>\n<p>We have incorporated one other colour into our design – the blue of the speed indicator when driving within a speed limit. Blue is neutral, carries that meaning, and is also of the same colorimetry as daylight. The theory is that it will be the least distracting colour as it’s what we’re most used to (the same as daylight).</p>\n<p>As discovered in our ebook, a very dark grey makes a better background than white, which can be too distracting and glaring. Dark grey here is the background, which represents nothing, while we use white to represent something. So black is discreet while white is attract. In fact, ‘discreet vs. attract’ is an idea we employed in all of our colour choices and even animation styles as discussed earlier, opting for a slightly pale colour palette to be discreet while also stepping away from neon Tron-like aesthetic of so many other HMI’s.</p>\n<p><img class=\"aligncenter size-full wp-image-7412\" src=\"http://ustwo.com/wordpress/wp-content/uploads/2015/02/Colours.jpg\" alt=\"Colours\" width=\"1382\" height=\"492\" /></p>\n<p>We utilise this attracting quality of white to draw attention to certain changes in driving conditions. For example, white is the colour of all icons that represent changes in the car and the road (on the Z axis described earlier), white is also used to display the gear, which changes throughout the drive. This concept isn’t strictly enforced in our concept at its current state, but may be something to work on.</p>\n<p>An idea that we have used throughout our concept is driver personalisation. Just as we can adjust type sizes for different drivers, we can also customise colours and hues for different drivers to increase contrasts or make compliant for various type of colour blindness.</p>\n<p>Colour is not the only feature we used to inform a visual language and infuse iconography with meaning, we also used shape.</p>\n<h4>Visual language and iconography</h4>\n<p>The visual language of an interface design helps users get to know and understand it, specifically over time, repeating and consistent visual cues help with mapping over time. Iconography, just like typography discussed earlier, is a big part of the language of the interface, so when it came to designing the icons, we did as we did with choosing colour, we stuck to the familiar, what people already know and understand. Why reinvent the wheel?</p>\n<p>The icons, where possible, are taken directly from road signs. Simple. If you’ve passed your driving test, then you will already know what all of the icons in our concept will mean. If you’re a UK driver, these will be icons based on British road signs. If you’re an American driver, these icons will be based on US road signs – yet another benefit of the digital display. This method also has the benefit of being ISO-compliant (ISO ensure identification and facilitation of use of icons/symbols).</p>\n<p>For those icons not covered by road signs, such as those that represent functions of the centre console and infotainment system, icons are derived from those that have become ubiquitous with the use of smartphones, such as message and music icons.</p>\n<p>Using already familiar icons limits dwell time and cognitive load. As each icon takes on a different shape, however, how do you distinguish quickly between which is imperative to acknowledge and which can be ignored? To tackle this questions, we built on the works of German-American psychologist Wolfgang Köhler, who influenced the 1929 <a href=\"http://en.wikipedia.org/wiki/Bouba/kiki_effect\" target=\"_blank\">Bouba/Kiki effect</a> study.</p>\n<p><img class=\"aligncenter size-full wp-image-7413\" src=\"http://ustwo.com/wordpress/wp-content/uploads/2015/02/kikibouba.png\" alt=\"kikibouba\" width=\"1788\" height=\"822\" /></p>\n<p>This effect is non-arbitrary mapping between speech sounds and the visual shape of objects. We have extrapolated this to signify iconography into two groups, a circle for passive icons (Bouba) which represents information where action is not required in the act of driving (i.e. a text message has been received) and a diamond for alert icons (Kiki) which represents information where action is required or should be observed in the act of driving (i.e. caution: accident ahead).</p>\n<p>We used these two shapes to contain the icons – giving them meaning (the pictogram) as well as action (the containing shape). This helps the driver subconsciously pick out the important information (Kiki) from the less important information (Bouba), reducing distraction and cognitive load.</p>\n<p><img class=\"aligncenter size-full wp-image-7414\" src=\"http://ustwo.com/wordpress/wp-content/uploads/2015/02/icons.jpg\" alt=\"icons\" width=\"1244\" height=\"400\" /></p>\n<p><em><em><strong>Above: </strong></em>icons incorporated into Bouba or Kiki</em><strong><strong> </strong></strong></p>\n<p>The flat nature of the concept also plays into the visual language. As nothing is “pressable” in this concept, with all interactions being soft interactions (action taken on by the HMI on the driver’s behalf or feedback loops inherent in the interactions of the drive) there is an importance to style the graphics as such, reserving a “pressable” visual language for elsewhere in the vehicle, such as the centre console. So, in our concept, all graphics are purely informational and there is nothing superfluous, justifying every pixel.</p>\n<h4>Branding</h4>\n<p>As we discussed in our ebook, we believe that branding is a very important part of the car and the experience of driving it. This is ignored in the HMI where elsewhere in the vehicle it is part of the very DNA of the design, for example you can tell a car is a Porsche by its iconic body shape and level of craft of the interior.</p>\n<p>The HMI, after all, is one of the main touchpoints the driver has with the brand, a poor experience with an alien identity does not do the brand, or the driver, any favours.</p>\n<p>Some of the discussion around fonts and colours earlier in this piece may seem to make any branding difficult. Using a brand’s typeface, for example, might not comply with some of the criteria we highlighted when selecting a font that is quick to read with minimal cognitive load.</p>\n<p>This is true, but we believe there is a responsibility on the designer to strike the right balance, with both brand and considered design in mind, akin to designing websites for brands at a time when choice of fonts on the web was limited.</p>\n<p><img class=\"aligncenter size-full wp-image-7768\" src=\"http://ustwo.com/wordpress/wp-content/uploads/2015/03/ferrari.png\" alt=\"ferrari\" width=\"1438\" height=\"988\" /> <img class=\"aligncenter size-full wp-image-7764\" src=\"http://ustwo.com/wordpress/wp-content/uploads/2015/03/merc.png\" alt=\"merc\" width=\"1438\" height=\"988\" /></p>\n<p><img class=\"aligncenter size-full wp-image-7765\" src=\"http://ustwo.com/wordpress/wp-content/uploads/2015/03/mercferrari.png\" alt=\"mercferrari\" width=\"1227\" height=\"388\" /><em><em><strong>Above: </strong></em>how our concept could be designed to comply with automotive manufacturer&#8217;s brand guidelines and unify the cluster with the interior and exterior of the car’s design</em></p>\n<h3><strong><br />Our process</strong></h3>\n<p>As a team, we believe in rigour with our process – a focus on craft, maintaining standards for human-centred design in interactions, using technology as a material and keeping in mind industry conventions and recommendations (ISO, NHTSA, ESOP).</p>\n<p><img class=\"aligncenter size-full wp-image-7442\" src=\"http://ustwo.com/wordpress/wp-content/uploads/2015/02/code.png\" alt=\"code\" width=\"1227\" height=\"505\" /></p>\n<p><em><strong>Above: </strong>Prototypes built and tested with the awesome <a href=\"http://framerjs.com/\" target=\"_blank\">Framerjs</a> platform for Javascript</em></p>\n<p><strong><strong> <img class=\"aligncenter size-full wp-image-7416\" src=\"http://ustwo.com/wordpress/wp-content/uploads/2015/02/test.png\" alt=\"test\" width=\"1224\" height=\"400\" /></strong></strong></p>\n<p><em><strong>Above: </strong>Very early in-car tests with a proxy screen &#8211; an iPad. Behaviours are best tested over time.<strong><strong> </strong></strong></em></p>\n<p>In this regard, we built multiple prototypes of our concept, constantly iterating along the way based on reading research / technical papers and testing. Testing will have to take into consideration both <strong>cross sectional and longitudinal studies</strong> over time to see how people will live with a particular design idea.  </p>\n<p>We believe what you see above is primarily an iteration we are happy with and by no means a final answer – but more of a conversation starter with the greater community.</p>\n<h3><strong>Conclusion</strong></h3>\n<p>We truly believe this is a small but important step forward in thinking about legacy feedback elements in cars. As is in the nature of all conceptual work, we wish to provoke a constructive discussion with this thought piece.</p>\n<p>When companies look to manage the digital and physical experience from the ground up, within their products and even services (e.g. Tesla, Apple with CarPlay, Google with the Android Auto OS), contextuality, connectivity and software is going to be enmeshed in their development like never before. We see a new exciting challenge, and huge opportunities for design and development.</p>\n<p>In this spirit, we ask you – the reader, designer, technologist, manufacturer – to offer your valuable feedback so we can push the envelope further with elements like the cluster – together. Given the opportunity, we wish to carry on experimenting and iterating with the idea – there is so much more to explore with multi-sensoriality in interior design (animations, benefits of optical illusion, audiovisual feedback etc.)</p>\n<p><a href=\"https://github.com/ustwo/autocluster\" target=\"_blank\"><img class=\"aligncenter size-full wp-image-7521\" src=\"http://ustwo.com/wordpress/wp-content/uploads/2015/02/unnamed.png\" alt=\"unnamed\" width=\"1000\" height=\"140\" /></a></p>\n<p>We have opened up the design elements and our early code to the community, so it can be further developed upon to create more magic and inspiration. Feel free to send us feedback or get stuck in with our concept and create your own iterations!</p>\n<p><a href=\"mailto:automotive@ustwo.com\" target=\"_blank\"><img class=\"aligncenter size-full wp-image-7465\" src=\"http://ustwo.com/wordpress/wp-content/uploads/2015/02/contacts1.png\" alt=\"contacts\" width=\"1010\" height=\"359\" /></a></p>\n",
        "date": "4 March 2015",
        "link": "/blog/cluster/",
        "category": "Design",
        "thumbnail": "http://ustwo.com/wordpress/wp-content/uploads/2015/03/ferrari.png",
        "author": {
          "name": "ustwo auto",
          "avatar": "<img alt='' src='http://0.gravatar.com/avatar/eea15c940cc47105a4ef573f6a2eccd6?s=110&amp;d=http%3A%2F%2F0.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D110&amp;r=X' class='avatar avatar-110 photo' height='110' width='110' />",
          "description": "This series of automotive posts has been carefully researched and written by a team of passionate designers as well as petrol heads comprising of Tim Smith, Harsha Vardhan and David Mingay."
        },
        "comments": {
          "items": [
            {
              "author": {
                "name": "Adam Poole",
                "email": "adam.poole@agustawestland.com",
                "avatar": "<img alt='' src='http://0.gravatar.com/avatar/ad516503a11cd5ca435acc9bb6523536?s=110' class='avatar avatar-110 photo avatar-default' height='110' width='110' />"
              },
              "content": "Some great insight here, and clearly a lot of work going into this. I'd agree with Richard above - a big rectangular block of colour in the centre of the dashboard is way too big an indicator. It also precludes the fact that a lot of drivers knowingly speed and would spend a lot of time (like on the motorway) seeing a red box. They know the speed limit, they know that 71 mph is too fast, but that's their choice. \r\n\r\nI work in aviation, and the trend in cockpit designs is towards more screens and a desire to 'fill them up' (usually because there are no designers involved). The opposite should be the case: what's the least amount of space we can take up? Pilots would prefer to be 'eyes out' where possible - actually looking at the potential safety threats. Quick bits of contextual data, clearly displayed would be ideal. Also, there has been a distinct trend away from dials to strip displays - mostly for the worse. Pilots build habits of scanning the dials and comparing the positions of the needles for anything out of place. Subtle changes are quickly compared and acted on. \r\n\r\nWhat would be useful is contextual markers on a speedo dial ('bugs') to nudge the driver along into slightly better habits (i.e. gear shift indicators) or better situational awareness (i.e. travel or weather problems, arrival time).\r\n\r\nSeeing this kind of work out in the open is great - brave and forward thinking. Good stuff.",
              "date": "2015-03-09 12:14:42"
            },
            {
              "author": {
                "name": "Rodney Mann",
                "email": "rodney.mann@bluespurs.com",
                "avatar": "<img alt='' src='http://0.gravatar.com/avatar/ad516503a11cd5ca435acc9bb6523536?s=110' class='avatar avatar-110 photo avatar-default' height='110' width='110' />"
              },
              "content": "Really great read. Thank you for the insight. \r\n\r\nThere are some stand alone solutions where products are straight-up replacing the stock instrument panels in cars, connecting through their computers' inputs in the dash (Parrot Asteroid for example). I wonder if this could achieve the same thing for techy DIY gearheads down the road if companies don't pick it up for their own custom clusters.\r\n\r\nI would love to see how this type of user experience could translate into other realms of UI. One possible application that comes to mind is biking, running, skateboarding, skiing, or snowboarding with headset wearables. \r\n\r\nLove your work. Keep it up!",
              "date": "2015-03-05 19:06:59"
            },
            {
              "author": {
                "name": "David Mingay",
                "email": "mingay@ustwo.com",
                "avatar": "<img alt='' src='http://0.gravatar.com/avatar/ad516503a11cd5ca435acc9bb6523536?s=110' class='avatar avatar-110 photo avatar-default' height='110' width='110' />"
              },
              "content": "@Richard\r\nRegarding the colours - we would want to test this thoroughly with users, refine and iterate. We did do some quick \"guerilla' tests and it wasn't deemed to be too garish. But we would need to test with real data, in real cars actually being driven (if possible). \r\n\r\n\"Just think about how annoying it is to hear the seatbelt sound go off if you start driving without it\" - there's a really good reason why it does that ;) You could argue that dangerous speeds on a public road should be highlighted.\r\n\r\nI think your point regarding the radial approach view being influenced by what you're used to, is a good point. We've deliberately challenged some traditional norms, so we can design and test alternatives to learn.\r\n\r\nWe don't agree that just having a number is enough - that's why we wanted to include the bar and other numbers so that you could see relative speed and see the rate in which it is increasing/decreasing. Again, something to be tested and iterated - it's our first pass at this.\r\n\r\nWe're already seeing large LED displays changing in context (Mercedes S Class for example), so we wanted to see if we could develop this further. Again, we want to test, learn and iterate to get this balance right. But you're right - too much will be dangerous!\r\n\r\n\"Knowing that everything I'd ever want to see is going to show up in its assumed position no matter if I'm driving or parked would be much more predictable to take in. \" - wouldn't it be great if we could see if an alternative is better. We'll only know when we test, learn and iterate!",
              "date": "2015-03-05 18:45:18"
            },
            {
              "author": {
                "name": "David Mingay",
                "email": "mingay@ustwo.com",
                "avatar": "<img alt='' src='http://0.gravatar.com/avatar/ad516503a11cd5ca435acc9bb6523536?s=110' class='avatar avatar-110 photo avatar-default' height='110' width='110' />"
              },
              "content": "Thanks to everyone for their comments - we'll respond to to a few:\r\n\r\n@Kevin\r\ni. The visual design for the prototype is 'vanilla', i.e. brand free. So you're right, it's missing that feel currently.  If we were to do this for real and partner with an OEM, we'd spend a lot of time working on creating something that echoes the brand and evokes the right emotion. This would take many weeks of work - we only had two. But what we did want to avoid is that typical, 'car poster from the 80's', Masculine, Tron-like graphics that seem to pervade every car manufacturer's HMI and cluster currently. We're not saying we've got it right - we're starting the debate.\r\n\r\nWe also believe that current HMIs or clusters never really capture in any close approximation the beauty, heritage and craft or the sheer attention given to car's exterior and interior designs - they currently seem like afterthoughts. This makes us sad. However, we deliberately didn't focus on that challenge at this point (for same reasons above), although the quick examples we put together for Mercedes and Ferrari allude to where things could go.\r\n\r\nI don't agree that RPM is the way to solve the \"feel\" issue unless you're driving a real sports car, in the \"appropriate\" environment. ;)\r\n\r\nBTW the Ferrari example is the California, the only Ferrari that defaults to automatic transmission, due to it being a Grand Tourer. We felt that was a good reason not to include rpm in this example. We do have a rough design for a version of the cluster with RPM, but the two week project duration stopped us from developing it.\r\n\r\nSpecific answers:\r\n1. Animations: We did some basic testing and it didn't seem an issue. But you could be right. We want to test a properly working prototype with real uses to get a feel of this. Build, Test, Iterate and Learn!\r\n2. I too prefer looking backwards and using the mirror (when reversing, that is). However, many cars, particularly SUVs and big 4x4s have very restricted views and I've seen many models with rear cameras recently (Lexus for example). But It needn't be a camera, it could be a visual representation of the reversing sensors, such as the one employed by BMW.\r\n3. Yes - this is exciting for us as well. Again, this really needs to be tested and iterated many times before we approach something conclusive.",
              "date": "2015-03-05 18:19:54"
            },
            {
              "author": {
                "name": "Wojciech Zalot",
                "email": "wojtek@woodie.pl",
                "avatar": "<img alt='' src='http://0.gravatar.com/avatar/ad516503a11cd5ca435acc9bb6523536?s=110' class='avatar avatar-110 photo avatar-default' height='110' width='110' />"
              },
              "content": "As some people before me mention it's good idea to work with car dashboard cluster, but don't get me wrong I have impression that this whole concept was done by person who doesn't use car at daily basis.\r\nRPM's are quite crucial, of course it's A/T car concept but for eg. you chose Ferrari to show your concept and Ferrari's it's for example one of the car which put RPM's as the centre and core of the dashboard, of course it's detail but still.\r\nAs I understand most of controls and informations will appear when they will needed, but I think still some of them are quite necessary like, gas level, information that lights are working, that hand brake is released and so on.\r\nAt some point user needs to know that everything is okay with car, and I would say that idea \"to show additional informations/icons only when something happened\" isn't saying that everything is okay, but this is of course only my point of view ;-)\r\n\r\nPersonally I don't have an issue with fake skeumorphism from Mercedes but Volvo idea is nice as well, and really fits into the exterior and interior of car, so I cannot imagine using something very generic and too simple for cars like that.\r\n\r\nFinishing I would say that this type of design / approach might work nice for drive less cars like Google ones where role of driver is very limited.\r\n\r\nAlthough it was very good reading and looking forward to read further how you can develop this idea.\r\nCheers!",
              "date": "2015-03-05 17:36:04"
            },
            {
              "author": {
                "name": "Martin Spurway",
                "email": "info@martinspurwaydesign.co.uk",
                "avatar": "<img alt='' src='http://0.gravatar.com/avatar/ad516503a11cd5ca435acc9bb6523536?s=110' class='avatar avatar-110 photo avatar-default' height='110' width='110' />"
              },
              "content": "I think this is a really interesting idea, and I love what you guys are doing. I feel this industry does need a refresh and a lot of the current clusters are stuck in the past. I do appreciate the reasons for this and think there are a variety of interesting solutions to this problem. My first question would be how many of the designers who made this own/ regularly drive a car? And how much do you consider not just the typography and colour for the brand but also the interior &amp; exterior styling of the car, and how the interface combines physical and digital cues to create a seemless branded experience. What makes a Ferrari and Ferrari and what makes a Mercedes a Mercedes. Not just a reskin with their brand font, but something a bit more suited to the physical experience of driving a car. It looks to me very much a tablet interface has been squeezed into the dashboard and as a result feels a little unrefined and doesn't fit into the space particually well. I appreciate the generic concept, has been designed to accomodate a variety of car brands and manufacturers but even when you have shown the branded mockups its feels to me more like a phone has been plonked into the middle of your steering wheel, and doesn't feel like a car I would want to drive. Like I said, I love what you guys are doing, I just think it need a bit more refinement in terms of fitting in with the physical experience of the car, and making a cohesive digital and physical solution that people want to use in their car whether dropping the kids off at school or on a weekend drive in the sunshine.",
              "date": "2015-03-05 14:43:27"
            },
            {
              "author": {
                "name": "Tom H",
                "email": "screenkraft1@gmail.com",
                "avatar": "<img alt='' src='http://0.gravatar.com/avatar/ad516503a11cd5ca435acc9bb6523536?s=110' class='avatar avatar-110 photo avatar-default' height='110' width='110' />"
              },
              "content": "great experiment.\r\nyou've obviously put a lot of thought into the concept.\r\nAs a UX designer &amp; long time driver (18yrs - England, 4 yrs-North America, 2yrs Germany), perhaps a few initial thoughts might be of interest.\r\n\r\nI haven't read through everything so apologies if you've addressed the following already. \r\n\"Speed shown in relation to the local speed limits and other parameters\"\r\n- love this, especially black ice, fog warnings etc. But they need to be hyper localized and in real time. Generic skid warnings displayed when temp &lt; x would end up being ignored, but if the system could use geographic and meteorological information to alert me when for example; I&#039;m driving on a sunny winters day, roads are dry, but the pass I&#039;m climbing is in the shadow of a north facing slope then for the less experienced driver who can&#039;t read the road, an ice warning could be life saving. Perhaps the system could collate data from on-board computers of vehicles that have driven through the area before you. E.g. stability control, traction control system of vehicle A detects wheel slip, broadcasts open source global alert. Your system relays this real, pertinent data to vehicle B as it  enters danger zone.\r\n\r\n&quot;Range status: Combining elements of a fuel gauge and range&quot; \r\nPersonally I just want a fuel gauge. In 25 years of driving I&#039;ve never known the fuel capacity, or theoretical range of those vehicles. When the tank gets low I fill up.\r\nAnd I only know the distances to destinations to which I&#039;ve made frequent trips. For the vast majority of trips I have only a vague notion of the distance. \r\nIn partnership with navigation software and real time traffic reports knowing the range might make sense, but only if I&#039;ve entered a destination somwhere; but simpler would be to just prompt a fill-up.\r\nIf the range info takes precedence then it could be misleading.\r\ne.g. driver&#039;s about to leave the highway (hi range) and enter a traffic snarl-up (low range). He passes fill-up opportunities on the highway as his fuel range is high, but in heavy stop-start traffic it plummets.\r\n\r\nPerhaps the system can be user customised. If so then personally I&#039;d just show the fuel gauge. Aside: love the way it increases the relative screen proportion and colour as fuel level decreases. \r\n\r\n&quot;Reverse: Rear-view camera takes over screen while reversing&quot;\r\nThis I have problems with. Not the implementation, but the overall existing concept. I&#039;ve never had a car with reverse cameras, but my concern is that as users will always take the path of least resistance they would rely solely on the camera option. \r\nI learned to drive in the UK with the fearsome &quot;reversing round a corner test&quot; With cross traffic, bikes on pavements/sidewalks &amp; pedestrians the only way to do this safely is to use multiple shoulder checks to monitor all the blind spots.\r\nReversing round a corner isn&#039;t part of the North American test, and is actively forbidden, but the manoeuvre is still relevant for three point turns using people&#039;s driveways, or reversing out of parking spaces (I never saw US/Canadian drivers reverse into spaces. With much larger spaces &amp; wider streets, they don&#039;t need to learn this skill).  Perhaps the feature is offered when geolocation determines you&#039;re at home &amp; reversing into a garage, or in a more controlled parking environment (e.g. parking garage). \r\n\r\nOk, Those are my main thoughts. Overall, some really nice thinking in there. Good work",
              "date": "2015-03-05 11:05:46"
            },
            {
              "author": {
                "name": "Charlie Southwell",
                "email": "charlie@wetransmute.com",
                "avatar": "<img alt='' src='http://0.gravatar.com/avatar/ad516503a11cd5ca435acc9bb6523536?s=110' class='avatar avatar-110 photo avatar-default' height='110' width='110' />"
              },
              "content": "This is utterly fantastic. I love the way that actually this visual feedback is likely to reduce speeding / speed fines too.",
              "date": "2015-03-05 11:02:08"
            },
            {
              "author": {
                "name": "Ugur Akin",
                "email": "u.akin@triodor.eu",
                "avatar": "<img alt='' src='http://0.gravatar.com/avatar/ad516503a11cd5ca435acc9bb6523536?s=110' class='avatar avatar-110 photo avatar-default' height='110' width='110' />"
              },
              "content": "It could have gone even faster if it had an extra gear! I assume the message pop up loops the increase speed code. FYI.\r\n\r\nAlso, while I appreciate the detailed look at visual feedback to augment the awareness of the driver I have to add that combustion engines are a eccentric obsession to those that enjoy driving - \"Petrol Heads\" as a tall balding man once said. Thus, I feel that as a game designer I would put my money on a parallax layer shift that gives the impression of speed - think of the layers of gauge slowly separating in depth as the speed increases. This way you augment the feeling of speed and can slowly fill a gradient that shifts from green to red / orange. I would refrain from the use of red - lets face it nobody wants to think of themselves burning to death every time they go over the speed limit. Finally, please include the rpm as well - even if you have to add the green thumb version that lets you grow a plant if you watch your lead foot.",
              "date": "2015-03-05 09:32:43"
            },
            {
              "author": {
                "name": "Asbjørn",
                "email": "asbjoern@stentebjerg.net",
                "avatar": "<img alt='' src='http://0.gravatar.com/avatar/ad516503a11cd5ca435acc9bb6523536?s=110' class='avatar avatar-110 photo avatar-default' height='110' width='110' />"
              },
              "content": "Interesting. You are probably right that the move to screens is an opportunity to rethink things. \r\n\r\nHowever, I think this is a bit too far in the opposite direction. You have nice, big screen - and all you use it for is displaying the speed. There is much information that is also relevant while driving. How about warning lights and other ambient information? I assume your intention is for things like engine temperature to be hidden, except if there is a problem - which will probably take a bit of getting used to, but I think that makes sense. Also, how would navigation directions be integrated?\r\n\r\nAnd, in typical American fashion, you show complete ignorance of the fact that in a car with a manual transmission (not just a in sports cars) you NEED a rev counter. I am seriously annoyed if I get in a car that doesn't have one.",
              "date": "2015-03-04 22:46:43"
            },
            {
              "author": {
                "name": "Kevin Velasco",
                "email": "kev@kalibrr.com",
                "avatar": "<img alt='' src='http://0.gravatar.com/avatar/ad516503a11cd5ca435acc9bb6523536?s=110' class='avatar avatar-110 photo avatar-default' height='110' width='110' />"
              },
              "content": "I feel like you guys are missing a core component of this.\r\n\r\nIt looks absolutely shit on a dashboard. I'm a designer, and I get that usability, practicality, and intuitiveness (especially) are things that we aspire to; however, I'm also a massive petrol-head. \r\n\r\nThe great thing about the console cluster is how it <i>feels</i>. How the power of the engine translates to this little dial rocking back and forth, pulsing with your foot on the pedal. The concept just feels so.. sterile. \r\n\r\nWhen you look at a great car from the outside, there's this energy about it that is hard to describe. When you're sitting in the car, there really isn't anything else to remind you about how good your car looks other than what's in front and around you. Great cars feel the way they look.\r\n\r\nCrux of the argument: Guys, put in an RPM gauge somewhere. Please.\r\n\r\nNow, I get where you guys are coming from, this is a functional prototype. I saw your post on the FramerJS group on facebook too. Great stuff.\r\n\r\nNow, onto concept: \r\n\r\n1. Huge screen wiping animations: No. Never. This is amazingly distracting and will probably kill someone. \r\n2. Reverse display: er, maybe! Have you ever seen someone back out of a driveway before? They're looking backwards. I've used a car with a reverse display before, but nothing beats looking out the back window. But even if this were the case, I wouldn't put it in the console. There's not enough space to realistically see anything. \r\n3. Adaptive display to track where my head is: THIS. THIS IS AMAZING. DO THIS.\r\n\r\nWelp, that's my 2c. Beep boop.",
              "date": "2015-03-04 21:45:27"
            },
            {
              "author": {
                "name": "Richard",
                "email": "richard@mrballermann.com",
                "avatar": "<img alt='' src='http://0.gravatar.com/avatar/ad516503a11cd5ca435acc9bb6523536?s=110' class='avatar avatar-110 photo avatar-default' height='110' width='110' />"
              },
              "content": "Great breakdown. Certainly a huge consideration given our reliance on severely outdated instrument clusters. A few points that stuck out for me (forgive me if they are covered in the post, I skimmed):\r\n\r\n-I find the visuals very loud. Seems as though it is bordering on distracting with the amount of color and scale being applied to the speedometer display. I want only as much notification as I would need to be visible. I don't need a giant colored screen glaring in my face while driving. The amount of color should be used as minimally as possible (if at all) unless you need to get the drivers attention such as in the case of a dangerous driving conditions or mechanical issue. I would never purchase a car that screams red when I happen to be speeding. Just think about how annoying it is to hear the seatbelt sound go off if you start driving without it, I know I need to be aware of these things but I certainly don't want to be nagged about my choices. A simple notification is fine and then please, just stop telling me what to do.\r\n\r\n-One thing I like about the traditional radial dial is that it shows a large range difference from min to max within a contained area. The transition to a rectangular bar gauge feels less efficient in terms of space. While the actual bar to indicate the position along the gauge isn't necessary I do think the a radial bar layout feels more natural and useful (likely a biased opinion for the typical approach). \r\n\r\n-The circle gauge that fills from the center out seems to be the least intuitive of the explorations in my mind. I can't get a good sense of where the value is in relation to 0 and maximum. Which begs the question, is a visual gauge even helpful? I think drivers really only need to see a concrete number displayed for speed. A visual translation of speed just adds mental math and distraction when I simply need to know exactly how fast I'm going (though your road condition indicators do rely heavily on the more visual approach).\r\n\r\n-I feel I'd be bothered by the constant switching between contextual displays. A general overview that doesn't change is absolutely my preference when driving. I might want to glance and see something that may not be totally pertinent to the task at hand but I would never need to actually think about what I am being show under varying circumstances. Knowing that everything I'd ever want to see is going to show up in its assumed position no matter if I'm driving or parked would be much more predictable to take in.\r\n\r\nAwesome project, would love to see where this goes from here.",
              "date": "2015-03-04 21:00:17"
            }
          ],
          "count": 12
        },
        "social": {
          "tweets": "664",
          "facebook": "465",
          "plus": "67",
          "total": 1196
        },
        "layout": {
          "categoryClass": "design"
        },
        "extraClasses": ""
      },
      {
        "id": 7329,
        "title": "Being T-Shaped",
        "excerpt": "Kayaking, snow storms and being T-Shaped.",
        "content": "<p>Being ‘T-shaped’ is a term that’s been trending recently. The ‘T’ is a metaphor used to describe a person’s skill profile – the vertical bar represents the depth of a person’s core expertise and the horizontal bar represents that person’s ability to contribute in areas outside of their core.</p>\n<p>When you’re part of a cross-functional product team, being T-shaped is incredibly important and this is well illustrated by digressing a little with some recent experiences of mine.</p>\n<p>Last year my girlfriend and I went on a kayaking trip in Sweden that involved 4 days of navigating on our own through the <a href=\"http://www.visitostergotland.se/archipelago\" target=\"_blank\">St. Anna archipelago</a> with only a sea map and a compass to guide us.</p>\n<p>We had a double-seated kayak constructed so that the front seat had space for the map and compass, and the back seat had foot pedals to control the rudder with a small space for another compass to ascertain the bearing. My girlfriend has a better sense of direction than me and so took up the front seat. I’m stronger than her, so took up the rear seat.</p>\n<p>We planned that she’d read the map, call out the bearing to me, I’d get us on the right course and then power on until we hit our next checkpoint. Simple.</p>\n<p>Day 1 went pretty smoothly as we covered only a short distance in the remaining light, but on day 2 we soon got lost. I can assure you that getting lost in St. Anna is a major issue when you’re trying to navigate through 6,000 tiny islands that all look virtually the same.</p>\n<p>The real problem stemmed, however, from the fact that whilst my girlfriend listened intently to the instructor before we set off, I figured it didn’t matter as she’d be taking care of navigation whilst I was just the engine. So whenever we got lost, my capacity to help figure out <br />how, where or why we’d gone wrong was next to nothing – I couldn’t have been less T-shaped in our team of two if I’d tried.</p>\n<p><img class=\"alignnone size-full wp-image-7332\" src=\"http://ustwo.com/wordpress/wp-content/uploads/2015/02/996916_10151798757071815_1972679799_n.jpg\" alt=\"Kayaking in Sweden\" width=\"960\" height=\"720\" /></p>\n<p>We found our way, in the end, but I learnt a tough lesson in Sweden. We were significantly slowed down, didn’t get to see all the places we wanted to and ‘debated’ more than we normally would in that situation. Above all it meant that the goal of having an amazing trip was compromised.</p>\n<p>This year we went to Iceland on another 4-day adventure, hiring a 4&#215;4 and driving many miles across the country to see the amazing sights. Though we got lost in Sweden, my girlfriend is still the better navigator, and whilst she&#8217;d beg to differ, I’m definitely the better driver. But we weren’t going to make the same mistake as our last trip and stick to our roles. This time we planned our routes together, navigated together, and both got insured to drive.</p>\n<p><img class=\"alignnone size-full wp-image-7333\" src=\"http://ustwo.com/wordpress/wp-content/uploads/2015/02/IMG_0059.jpg\" alt=\"Iceland snow storm\" width=\"640\" height=\"480\" /></p>\n<p>We’d made concerted efforts to be T-shaped and it paid off, especially when extreme snow storms hit and navigating got incredibly difficult. We still got lost, but we always figured out where we’d gone wrong quickly and were able to get back on track with little delay. This meant there were no hold ups (other than waiting out the snow storm!), we saw everything we planned to see, and we had an incredible time which meant we achieved the goal of our trip.</p>\n<p>The above scenarios are no different to how things work in a cross-functional product team. There are specific functions and roles that need to be fulfilled in order to achieve the goal of the team.</p>\n<p>If you’re lucky enough to be part of or involved with such a team then ask yourself how many times has one of your developers gotten stuck and you haven’t been able to help? How many times has a design challenge required more brains but you haven’t felt equipped to contribute? Or how often does someone struggle with the amount of testing on their plate? </p>\n<p>Being T-shaped doesn’t mean we need to be experts in every field (we’ll leave that to Elon Musk) but by reaching outside of our core expertise and growing our skills into other domains we can be more useful to each other, have a better chance of achieving our goals and, as my girlfriend will confirm, you’ll be sure to have a better time on the journey.</p>\n",
        "date": "3 March 2015",
        "link": "/blog/being-t-shaped/",
        "category": "Culture",
        "thumbnail": "http://ustwo.com/wordpress/wp-content/uploads/2015/02/996916_10151798757071815_1972679799_n.jpg",
        "author": {
          "name": "Adam Taylor",
          "avatar": "<img alt='' src='http://1.gravatar.com/avatar/1ad33659fc1f37d8ec0cb7e4dc82a142?s=110&amp;d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D110&amp;r=X' class='avatar avatar-110 photo' height='110' width='110' />",
          "description": "Adam is an Agile Coach at ustwo London. He's passionate about helping teams build products, and he really loves cricket."
        },
        "comments": {
          "items": [],
          "count": 0
        },
        "social": {
          "tweets": "18",
          "facebook": "26",
          "plus": "1",
          "total": 45
        },
        "layout": {
          "categoryClass": "culture"
        },
        "extraClasses": ""
      },
      {
        "id": 7326,
        "title": "ustwo Thinks – Why Products Fail",
        "excerpt": "ustwo Thinks | Why Products Fail and What Differentiates Those that Succeed",
        "content": "<p>For every breakout success story – Facebook, WhatsApp, Uber or Instagram – there is a catalogue of dismal, and not-so-dismal, failures. We&#8217;re all accustomed to the concept of &#8216;failure&#8217; with digital products, and there&#8217;s been a lot of discussion about what it means. For the first ustwo Thinks event, we wanted to look at <em>why</em> products fail and what differentiates those that succeed.</p>\n<p>We invited forty people to our London studio to hear a panel discussion between four incisive thinkers: Jules Coleman, co-founder of <a href=\"https://hassle.com/uk\" target=\"_blank\">Hassle</a>, George Berkowski, entrepreneur and author of <a href=\"http://mybilliondollarapp.com/how-to-build-a-billion-dollar-app-book/\" target=\"_blank\"><em>How to Build a Billion Dollar App</em></a>, Eileen Burbidge, partner at <a title=\"Passion Capital\" href=\"http://www.passioncapital.com/\" target=\"_blank\">Passion Capital</a> and Tim Kim, Head of Product at ustwo.</p>\n<p>Fortified with an amazing espresso martini (or two), we had a wide-ranging discussion moderated by Collin Lyons, Head of Project Delivery at ustwo.</p>\n<p class=\"p1\">Before the discussion even began, a raise of hands showed that virtually everyone in the audience had at one time worked on a product, or at a product-led company, that had experienced a significant failure.</p>\n<p>Almost all of those people agreed that there was something meaningful they could have done to avoid it. With that setting, from a such a broad cross-section of industries and approaches, Collin&#8217;s suggestion that each experience of failure was &#8216;an opportunity&#8217; set a recurrent theme for the debate. </p>\n<h3><img class=\"alignnone size-full wp-image-7664\" src=\"http://ustwo.com/wordpress/wp-content/uploads/2015/02/WIN.gif\" alt=\"ustwo Thinks gif\" width=\"1400\" height=\"900\" /></h3>\n<h3>Defining Failure and Success</h3>\n<p>What do we mean when we talk about failure and success? Tim outlined the difference between a failure as a result of an experiment – an idea you tested to find out precisely whether it would work, or not, and the simple failure of something you expected to succeed. This difference is key when working with a genuinely experimental mindset, where proving or disproving a hypothesis through failure can be equally valuable.</p>\n<p>But some business failures are obvious to all – and clearly not intended as an &#8216;experiment&#8217;. Jules suggested Fab.com’s precipitous rise and <a href=\"http://uk.businessinsider.com/how-billion-dollar-startup-fab-died-2015-2?r=US\" target=\"_blank\">fall</a> was due to explosive growth and a massive influx of investment before ‘they’d really nailed their business model. Being a UK startup,&#8217; she said, &#8216;we know we have less funding than our US counterparts, and so the story goes that we spend it smarter, we’re leaner – and there is a grain of truth in that. You can have 330 million, and if your core business model doesn’t make sense, you’ll fritter that away.&#8217;</p>\n<blockquote><p>access to capital alone does not make a good business<br />Jules Coleman</p>\n</blockquote>\n<p>Eileen agreed with Jules, saying that &#8216;being early can be as bad as being late. And having the most capital, being the most funded, doesn’t necessarily guarantee success.&#8217; Her own experience made her think that ‘the definition of failure is closely related to the context and expectations placed on something in the beginning,&#8217; going on to describe her involvement in the failed Apple Newton PDA project in the mid-nineties. Initially hyped as a device for everyone to carry in their back pockets, the commercial and technological realities of the time meant it was a serious flop. Nobody could afford 2,000 dollars for that type of product. Working to develop internet connectivity for the device led to the criticism (and now witticism) that &#8216;no-one is going to surf the internet on something this small&#8217;, but despite this product&#8217;s failure, it was remarkably prescient, showing the way forward – twenty years too early – for personal mobile devices that are now ubiquitous.    </p>\n<p><img class=\"alignnone size-full wp-image-7666\" src=\"http://ustwo.com/wordpress/wp-content/uploads/2015/02/Screen-Shot-2015-02-26-at-11.04.30-AM.png\" alt=\"espresso martini\" width=\"613\" height=\"612\" /></p>\n<h3>Failure in Action</h3>\n<p class=\"p1\">Asked &#8216;what’s a failure that you’re proud of, and what did you learn?&#8217; the panel talked through several examples. </p>\n<p>George said of Hailo, and tech companies in general, that &#8216;even though your idea might have been great in year one, year two, the same idea may not be relevant in year three. The internet and mobile world moves ridiculously quickly.&#8217; The need to constantly evolve and respond to change – whether that&#8217;s new competitors or the availability of a new platform – was a common theme throughout the evening.</p>\n<p>Jules talked about Hassle&#8217;s decision at the end of 2012 to switch focus from offering a wide range of local services to just one – cleaning. This marked the turning point for the business. Although it meant an acceptance of failure, and a painful decision to scrap a lot of what they&#8217;d built, the focus on one thing led quickly to success.</p>\n<p class=\"p1\"><span class=\"s1\">Collin brought the discussion round to the notion of ‘embracing failure’, and the recent use of language around this sparked by lean experimentation. Jules felt that to be an entrepreneur you need to bring a balance of grit, determination and gut feel so that when you hit an obstacle ‘you’re not packing up and going home.’ On the other hand, she thought that being too embracing of failure – thinking ‘well it just happens’, and not examining why it was a danger for any company. Eileen rejected the use of &#8216;embracing&#8217; as something to be done with our failures, as it implies holding on to it. &#8216;The best thing to do,&#8217; she said, &#8216;was to learn from it and move on.&#8217; </span></p>\n<h3>Limiting and Managing Failures</h3>\n<p>One question from the audience asked panellists whether it was sheer scale of ambition that could lead products to fail. Was it the need to create ever bigger businesses as funding rounds come in that brings ultimate failure? Eileen disagreed, referencing the space programme and saying &#8216;you have to have ambition … If it fails then it&#8217;s more from hubris, or a lack of self-awareness.&#8217; Jules talked about the potential burden of large-scale funding, raising expectations and possibly making things more difficult.</p>\n<p>Asked &#8216;how do you manage the fear of failure?&#8217; by an audience member, George spoke first to say that &#8216;I don&#8217;t think any of us have a fear of failure, as such – it&#8217;s more trying to get to the next milestone of what a product is delivering and having the right numbers to go after it.&#8217; His perspective on this, as someone creating their own product, was contrasted by Eileen with the experience of people working at a salaried position within a big company – perhaps on an R&amp;D project or experiment – where it is all about expectation management and the possibility of personal development whether the product succeeds or not.</p>\n<blockquote><p class=\"p1\"><span class=\"s1\">Assuming that you’re trying to be innovative, disruptive or at least interesting, if you are not fearful or afraid of failure you’re probably not being ambitious enough<br /></span>Eileen Burbidge</p>\n</blockquote>\n<p><img class=\"alignnone size-full wp-image-7676\" src=\"http://ustwo.com/wordpress/wp-content/uploads/2015/02/1F2B1492-small.jpg\" alt=\"ustwo thinks panel in discussion\" width=\"5239\" height=\"3493\" /></p>\n<h3>Types of failure</h3>\n<p>Tim returned to the idea of two different types of failure. One to avoid, where you go into something without real care, and come out without reflecting on it and the alternative – ‘when experiments are planned and are rigorous, then an outcome that is a ‘failure’ is a good thing – that’s what people mean when they say fail fast and fail often.’ Failure as part of experimentation like this forms part of a solid methodology for developing great products. </p>\n<p>George followed on this theme, saying that &#8216;calculated failure is good. It just means good testing.&#8217; He argued that testing needn&#8217;t disturb your customers, and that you should simply be smart about where and how you test new features. </p>\n<p><img class=\"alignnone size-full wp-image-7689\" src=\"http://ustwo.com/wordpress/wp-content/uploads/2015/02/1F2B1394.jpg\" alt=\"ustwo thinks\" width=\"5760\" height=\"3840\" /></p>\n<h3>Working towards success</h3>\n<p>One key point of agreement on how to manage and face up to failure was to ensure you put your best people on your hardest projects. Careful hiring and a strong belief in feedback and self-criticism are essential for managing and, hopefully, avoiding the possibility of failure. George pointed out the value in outlining at the start for a project what disaster looks like, giving people an understanding of how, if it happens, you will mitigate it and get out of it. </p>\n<p>To conclude the discussion, Collin asked the panel for their advice on building products for success. Eileen felt that the main thing was to focus on what you are trying to achieve, rather than on how to mitigate failure. George said that a conscientious focus on your customer should be central. Rather than talking to a small, self-selected group of people you know – ‘talk to five hundred, talk to one thousand people about your idea’.</p>\n<blockquote><p>Pitch your idea. Pitch the problem. Pitch your solution<br /> George Berkowski</p>\n</blockquote>\n<p>Tim’s advice was to highlight an eye-opening study showing that a survey of failed startups gave a figure of 42 per cent who hadn’t found a market for their product.</p>\n<p>Jules said that working in a startup you have to be prepared to look at the numbers and see when your assumptions are shown to be wrong, and then to change the business model as necessary to fit the data you have.</p>\n<p>Eileen left us with the thought that if failure is inevitable then it&#8217;s something you can accept and move on from – what you really want to avoid is to regret something not because it was a failure, but because it&#8217;s something you haven&#8217;t done.</p>\n<p>The next ustwo Thinks event will be on 6 May – ustwo Thinks: Does Culture Create Value? If you&#8217;d like more info, drop us a mail at <a href=\"mailto:events@ustwo.com\" target=\"_blank\">events@ustwo.com</a>.</p>\n<p>#ustwothinks</p>\n",
        "date": "26 February 2015",
        "link": "/blog/ustwo-thinks-why-products-fail/",
        "category": "Design",
        "thumbnail": "http://ustwo.com/wordpress/wp-content/uploads/2015/02/ustwo_thinks_logo_white.png",
        "author": {
          "name": "ustwo",
          "avatar": "<img alt='' src='http://0.gravatar.com/avatar/45f535a0b9bb437628b6f49a55536234?s=110&amp;d=http%3A%2F%2F0.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D110&amp;r=X' class='avatar avatar-110 photo' height='110' width='110' />",
          "description": "We're a global digital product studio dreaming and doing transformative client, own product and venture work."
        },
        "comments": {
          "items": [],
          "count": 0
        },
        "social": {
          "tweets": "56",
          "facebook": "12",
          "plus": "0",
          "total": 68
        },
        "layout": {
          "categoryClass": "design"
        },
        "extraClasses": ""
      },
      {
        "id": 7462,
        "title": "Start making your presentations for five-year-olds",
        "excerpt": "Creating an intriguing presentation isn't easy. Here we provide some key ingredients and tips on how to attract the attention of your audience.",
        "content": "<p>Making a presentation interesting is hard. How do you avoid having the audience fall asleep 10 minutes in? What are the elements that make up a good presentation? How do you get your message across? Here are some tips and things to have in mind to keep focus throughout your slides.</p>\n<h3>Think about your target audience</h3>\n<p>If you are presenting to your boss you might want to consider that he or she doesn’t have the time or interest to go through a hundred slides of complex information and numbers. Dumb it down. Imagine telling your story to a 5-year-old. In general, most people have short attention spans, so you need to keep your message simple, short and engaging.</p>\n<p><div id=\"attachment_7502\" style=\"width: 1290px\" class=\"wp-caption alignnone\"><img class=\"size-full wp-image-7502\" src=\"http://ustwo.com/wordpress/wp-content/uploads/2015/02/352595_1280.jpg\" alt=\"Imagine that you would create your presentation for David Brent from The Office (played by Ricky Gervais). How would you do it?\" width=\"1280\" height=\"929\" /><p class=\"wp-caption-text\">Imagine that you&#8217;re creating your presentation for David Brent from The Office (played by Ricky Gervais). <br />How would you do it?</p></div><br />\n<h3>Grab inspiration from storytelling</h3>\n<p>Instead of presenting a bunch of slides packed with hard-to-read graphs and numbers, try to identify the key insights and remove everything else. Imagine that your presentation is a compelling story that you want to tell.</p>\n<p>Try to use more human language and tell it like it’s a short story with one or more characters playing different parts. By approaching it from a storytelling perspective, not only will the process be more fun, you will also have a more efficient and memorable presentation.</p>\n<h3>Who’s the character of the story?</h3>\n<p>Build your story around a character to make it more human and easy to relate to. As soon as people start identifying themselves with the character they will be emotionally invested in the story and are thereby more likely to stay interested throughout the presentation.</p>\n<p>Sometimes you might also want to use two opposing characters to make it even more intriguing. Does your story have a hero and a villain? Is there a conflict between the two that the story can build on?</p>\n<p><div id=\"attachment_7472\" style=\"width: 1930px\" class=\"wp-caption alignnone\"><img class=\"size-full wp-image-7472\" src=\"http://ustwo.com/wordpress/wp-content/uploads/2015/02/character.jpg\" alt=\"Build a character, for example Ted the polar bear.\" width=\"1920\" height=\"1080\" /><p class=\"wp-caption-text\">Ted the polar bear could be the character which your story is built around to add more emotion to your presentation.</p></div><br />\n<h3>Simplify</h3>\n<p>Focus on one thing at a time. Don’t show several bar charts on the screen at the same time unless there’s a point in comparing them with each other.</p>\n<p><div id=\"attachment_7473\" style=\"width: 1930px\" class=\"wp-caption alignnone\"><img class=\"wp-image-7473 size-full\" src=\"http://ustwo.com/wordpress/wp-content/uploads/2015/02/simplify.png\" alt=\"Focus on one thing at a time.\" width=\"1920\" height=\"1080\" /><p class=\"wp-caption-text\">Focus on one thing at a time.</p></div><br />\n<h3>Step-by-step reveal</h3>\n<p>Avoid showing everything at once. Show one thing and talk about that, then show another and talk about that.</p>\n<p>Don’t reveal it all at once or the audience will stop listening to you and instead try to read what’s on the screen. The step-by-step reveal will create anticipation and make the audience more interested in what you have to say.</p>\n<p><div id=\"attachment_7474\" style=\"width: 1290px\" class=\"wp-caption alignnone\"><img class=\"wp-image-7474 size-full\" src=\"http://ustwo.com/wordpress/wp-content/uploads/2015/02/StepByStepReveal_720p.gif\" alt=\"Reveal things step by step.\" width=\"1280\" height=\"720\" /><p class=\"wp-caption-text\">Create anticipation and make the audience more interested in what you have to say by revealing things step-by-step.</p></div><br />\n<h3>Big typography and contrast</h3>\n<p>= readability and simplicity. You don’t want to have the audience squinting in order to see what’s on the screen. By limiting yourself to a set of larger font sizes you will force yourself to focus on the pure essence of what you want to say.</p>\n<p>Closely related to this is contrast and colour difference. Many projectors have a bad color range and the contrast is poor. If the contrast in your presentation is too low you will have readability issues. For example, don’t use <span style=\"color: #ffffff; background-color: #ffff00;\">white text on a yellow background.</span></p>\n<h3>Show the tip of the iceberg</h3>\n<p>Only show the most relevant piece of data. Sometimes one number is enough. What is the high versus the low points? Could the data insight be compressed into one simple sentence?</p>\n<p>Having the ability to reveal more data is also powerful when the audience have more detailed questions. Show the tip of the iceberg but allow people to dig deeper if they want to know more.</p>\n<p><div id=\"attachment_7475\" style=\"width: 1930px\" class=\"wp-caption alignnone\"><img class=\"wp-image-7475 size-full\" src=\"http://ustwo.com/wordpress/wp-content/uploads/2015/02/sentence.png\" alt=\"Pick out the key insights.\" width=\"1920\" height=\"1080\" /><p class=\"wp-caption-text\">Pick the absolutely key insight from the data and turn it into one simple sentence.</p></div><br />\n<h3>“There are no slides”</h3>\n<p>With seamless animation and interaction you can find other ways of presenting your story than in the traditional slide-by-slide method. Why not try to make a website that people can interact with instead of a keynote? Make sure there’s a natural animation flow and that there is some consistency in how things move between the different parts of your story. For example, have a vertical movement whenever the story is progressing and have separate elements fade, move and scale in as they enter or exit the screen. Be creative, but make sure that you don’t overdo it.</p>\n<h3>Humour</h3>\n<p>Humouristic elements will also help make the experience more enjoyable and relaxed.</p>\n<p><center><iframe width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/_sRhuh8Aphc?feature=oembed\" frameborder=\"0\" allowfullscreen></iframe><br /><em>A scene from the classic rock music mockumentary </em>This Is Spinal Tap<em>.</em></center>\n<p> </p>\n<h3>Use videos</h3>\n<p>Emphasize what you are talking about through showing a sequence from a movie, a famous speaker, a music video, an animation etc. Make sure you don’t talk during the video – let the video speak for itself.</p>\n<h3>Use tangible examples of your ideas</h3>\n<p>Hack it, craft it and experiment. Put your idea in the hands of people in the audience. Whether it’s a video, prototype application, physical prototype or something else, make it feel real even if it’s a concept. By putting something concrete to play around with in front of people, the story will become more tangible, easy to understand and interesting.</p>\n",
        "date": "20 February 2015",
        "link": "/blog/start-making-your-presentations-for-five-year-olds/",
        "category": "Design",
        "thumbnail": "http://ustwo.com/wordpress/wp-content/uploads/2015/02/character.jpg",
        "author": {
          "name": "Tobias Arréhn",
          "avatar": "<img alt='' src='http://1.gravatar.com/avatar/5315b3c3ce32f05a118c74a465fa7059?s=110&amp;d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D110&amp;r=X' class='avatar avatar-110 photo' height='110' width='110' />",
          "description": "Lead Visual Designer at ustwo Malmö with a passion for bringing UIs to life with the help of motion design. As a designer you should always ask yourself: \"How would this animate?\""
        },
        "comments": {
          "items": [],
          "count": 0
        },
        "social": {
          "tweets": "28",
          "facebook": "53",
          "plus": "1",
          "total": 82
        },
        "layout": {
          "categoryClass": "design"
        },
        "extraClasses": ""
      },
      {
        "id": 7144,
        "title": "Being Inclusive Doesn't Need to be Complex",
        "excerpt": "What happens when difficult, emotive, problems call for simple non-tech solutions?",
        "content": "<p>As designers, we strive to create products that improve people’s lives and we more often than not look for tech solutions to problems. For example, interesting things are beginning to happen on the home automation front, with Apple, Google and Samsung rolling out plans for smart homes and kitchens this year. The prospect of having a digitally-connected home ecosystem is fast becoming a reality – examples include <a href=\"https://developer.apple.com/homekit/\" target=\"_blank\">Apple’s Homekit</a> framework, the <a title=\"Works with Nest\" href=\"https://workswithnest.google.com/\" target=\"_blank\">Google Works with Nest</a> programme, and <a href=\"http://www.samsung.com/uk/home-appliances/\" target=\"_blank\">Samsung’s Smart Home</a> initiative. But what happens, though, when difficult, emotive problems call for simple non-tech solutions?</p>\n<p><div id=\"attachment_7200\" style=\"width: 3344px\" class=\"wp-caption alignnone\"><img class=\"size-full wp-image-7200\" src=\"http://ustwo.com/wordpress/wp-content/uploads/2015/01/wayfindr.png\" alt=\"The ambition of the wayfindr project is to guide users from waypoint to waypoint underground, using smartphones and Bluetooth Low Energy technology\" width=\"3334\" height=\"1859\" /><p class=\"wp-caption-text\">The ambition of the wayfindr project is to guide users from waypoint to waypoint underground, using smartphones and Bluetooth Low Energy technology</p></div>\n<p>Seeing potential to build on our experience through <a title=\"Wayfindr\" href=\"http://ustwo.com/blog/designing-wayfindr/\" target=\"_blank\">Wayfindr</a> (a collaboration with RLSB aimed at increasing independence on public transport for the vision impaired), covered here in <a href=\"http://www.wired.co.uk/news/archive/2014-08/12/wayfindr-app\" target=\"_blank\">Wired</a>, we felt that new tech developments could be used to bring similar benefits at home.</p>\n<h3><strong>Problems in the kitchen</strong></h3>\n<p>The kitchen presents a number of problems for vision impaired people, from over-pouring liquids, walking into open kitchen drawers and cabinets, difficulty identifying ingredients and packages, checking expiry dates, to operating the microwave and cooker. </p>\n<p><div id=\"attachment_7146\" style=\"width: 5194px\" class=\"wp-caption alignnone\"><img class=\"size-full wp-image-7146\" src=\"http://ustwo.com/wordpress/wp-content/uploads/2015/01/IMG_4941.jpg\" alt=\"Michael cooking unaided in his kitchen, relying on his senses of touch, smell, taste and sound\" width=\"5184\" height=\"3456\" /><p class=\"wp-caption-text\">Michael cooking unaided in his kitchen, relying on his senses of touch, smell, taste and sound</p></div>\n<p>For vision impaired people these difficulties in the kitchen can lead to reduced confidence and independence, which in turn may mean they&#8217;re more likely to rely on processed food and less likely to eat healthily.</p>\n<p>We initially looked at the current assistive tools available and found numerous products and gadgets including organisational aids like digital labels using voice recording, kitchen appliances such as digital weighing scales and talking liquid level indicators. Despite these solutions though, our research revealed that the majority tended not to use assistive technology in the kitchen, mainly because they were expensive and difficult to use. It became clear that tech-driven solutions were not necessarily the answer.</p>\n<h3><strong>Michael and Courtney</strong></h3>\n<p>The RLSB introduced us to Courtney and Michael, who shared their insights and gave us a more multi-layered understanding of their own personal strategies in the kitchen and how they complete tasks safely. Michael explained the heavy cognitive load a vision impaired person is almost always dealing with in this environment, “As a sighted person, you don’t have to remember where everything is. Being blind means having to remember everything from where you put something down weeks or mere seconds ago, to which drawers and cupboard doors you’ve left open and what you were just holding, etc.”</p>\n<p><div id=\"attachment_7148\" style=\"width: 5194px\" class=\"wp-caption alignnone\"><img class=\"size-full wp-image-7148\" src=\"http://ustwo.com/wordpress/wp-content/uploads/2015/01/IMG_4951.jpg\" alt=\"Michael works at the kitchen counter, with an organised system for implements and ingredients\" width=\"5184\" height=\"3456\" /><p class=\"wp-caption-text\">Michael works comfortably in his own kitchen as he is familiar with how he has organised tools and spaces within it</p></div>\n<p>This process obviously becomes more complex when living with other people. Courtney added, “Something that becomes a problem for me is when my siblings put empty cans back in the cupboards, because I can’t tell as quickly if they’re empty or not&#8221;. Another issue she highlighted concerned her family forgetting to close the kitchen cupboard doors, and them becoming a potential hazard.</p>\n<p>Generally speaking though, both Courtney and Michael were comfortable in their own surroundings, having established organisational rules about where things belong in a defined space, such as alphabetising the spice rack or structuring fridge contents. “It’s all about being systematic,” explained Michael, “I always have uncooked ingredients on the left and prepared ingredients on the right, or angle the handle of a pan at 7 o’clock.”</p>\n<h3>Safety confidence and motivation</h3>\n<p>Both stated that having people around helped their confidence specifically when using the cooker and oven. Courtney said that she isn’t at all afraid of working with hot water, but is highly aware of the fire risk when using the cooker. But being independent and not relying on other people to help them is something they both wanted. Michael said, &#8220;what you lose straight away when you lose your eyesight is your independence and privacy.&#8221;</p>\n<h3>Applying Simple Techniques</h3>\n<p>We decided to look into an analogue system to help with using the cooker – a major barrier to full independence in the kitchen. We used tactile, raised stickers of different sizes (similar to <a href=\"http://shop.rnib.org.uk/labelling/bumpons-and-tactimark/icat/bumponsandtactimark\" target=\"_blank\">Bumpons</a>) to mark out the different buttons – the main principle being if a vision impaired person is able to find and identify the basic buttons and functions, and understand how they control the cooker, they will be able to learn to use it safely and efficiently over time. Using gem stickers bought from a stationery store, we tested out a system of markers on a microwave and a cooker hob.</p>\n<p><div id=\"attachment_7149\" style=\"width: 5194px\" class=\"wp-caption alignnone\"><img class=\"size-full wp-image-7149\" src=\"http://ustwo.com/wordpress/wp-content/uploads/2015/01/IMG_4978.jpg\" alt=\"Trying out the raised sticker system on the convection hob in Michael’s kitchen\" width=\"5184\" height=\"3456\" /><p class=\"wp-caption-text\">Trying out the raised sticker system on the convection hob in Michael’s kitchen</p></div>\n<p>For the cooker, we marked out the on/off button with a large gem sticker, and then marked out regular intervals on the dial face with smaller gem stickers to indicate small, medium and high heat settings. Blindfolded, we found it effective in finding the right heat setting and turning it on. Clearly, this wouldn’t work for every appliance, but we’d made a significant improvement without a line of code. Both Michael and Courtney felt that this simple solution of raised stickers on the cooker hob and on a microwave oven took them a small step closer to cooking independently.</p>\n<h3>Do not over-complicate solutions</h3>\n<p>When we first started thinking around home automation, it was tempting to go crazy with all the ways technology could “solve” each and every need or want we uncovered in our research. The many everyday hurdles that, as designers, we identified as being problematic including how to know when to stop pouring water into a glass or knowing when to empty a bin – usually had very simple, practical and sometimes unexpected solutions. Putting your finger in the glass to tell the level, for example, or putting your hand in the bin to feel how full it is. There was therefore no real need for connected bins to send out push notifications, or digital receptacles to alert you as they reach capacity. By slowing down and listening to what vision impaired people were actually saying about solving problems, it was clear that less was more. </p>\n<p><div id=\"attachment_7153\" style=\"width: 5194px\" class=\"wp-caption alignnone\"><img class=\"size-full wp-image-7153\" src=\"http://ustwo.com/wordpress/wp-content/uploads/2015/01/IMG_4723.jpg\" alt=\"Experience mapping our simulated experience of cooking blind helped us add dimensions to our journey\" width=\"5184\" height=\"3456\" /><p class=\"wp-caption-text\">Experience mapping our simulated experience of cooking blind helped us add dimensions to our journey</p></div>\n<p>Another point was that more features didn&#8217;t necessarily mean a better solution. It’s a well-known rule in software that 80 per cent of users only use 20 per cent of features, and it&#8217;s here where we should be focusing the majority of our design effort.</p>\n<h3>Conclusion</h3>\n<p>As designers of digital products, we often look first to digital or technological solutions to the problems we set out to solve. We also sometimes hope to identify particularly difficult problems to work with.</p>\n<p>In this exploratory research we learnt that a low-tech solution to allow someone to carry out a straightforward task can increase one&#8217;s sense of independency and confidence. We also learned that independence is not something that happens with a wave of a magic wand or one single magical product – often, it&#8217;s a combination of factors, in this case, safety, confidence and motivation.</p>\n<p>Observing Courtney and Michael in their kitchens showed us that their social contexts play a big part in the type of tasks a vision imparied person would be comfortable undertaking. Usually, it&#8217;s a task that they can already complete safely and confidently, and the tasks that they have problems with are often undertaken by a sighted person. Therefore, the opportunity to try to learn to do it themselves may not be presented, even if the personal motivation is there.</p>\n<p>In the case of solving the problem with turning on the cooker hob, the solution this time was not a digital application or product, but a simple analogue one, in the shape of a raised sticker. This taught us that, as designers of digital products, we need to stay open to the possibility of ‘simple’ analogue solutions as much as digital ones. We need to look at the bigger social context of the people facing the problems we are trying to solve and reach further than only digital solutions.</p>\n<p>We hope that by providing one small step towards making a problematic task easier, or “closing that small gap” in a user journey, we can shift a task from “problematic” to “do-able”.</p>\n<h4>About the authors:</h4>\n<p>Narges Jalali, Isabelle Bärgh, and Pearlyn Quan are interaction designers at ustwo. We were also helped a great deal by our intern Ty Lertwichaiworawit on this project.</p>\n<p>If you are interested in the issues outlined in this post, and would like to get involved or find out more, you can get in touch with narges@ustwo.com, pearlyn@ustwo.com or isabelle@ustwo.com or Katherine Payne at the <a href=\"http://www.rlsb.org.uk/\" target=\"_blank\">RLSB</a>.</p>\n",
        "date": "12 February 2015",
        "link": "/blog/being-inclusive-doesnt-need-to-be-complex/",
        "category": "Design",
        "thumbnail": "http://ustwo.com/wordpress/wp-content/uploads/2015/01/IMG_4978.jpg",
        "author": {
          "name": "ustwo",
          "avatar": "<img alt='' src='http://0.gravatar.com/avatar/45f535a0b9bb437628b6f49a55536234?s=110&amp;d=http%3A%2F%2F0.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D110&amp;r=X' class='avatar avatar-110 photo' height='110' width='110' />",
          "description": "We're a global digital product studio dreaming and doing transformative client, own product and venture work."
        },
        "comments": {
          "items": [],
          "count": 0
        },
        "social": {
          "tweets": "26",
          "facebook": "63",
          "plus": "3",
          "total": 92
        },
        "layout": {
          "categoryClass": "design"
        },
        "extraClasses": ""
      },
      {
        "id": 7295,
        "title": "I'd Like to Make the Next Uber – How Much Will it Cost?",
        "excerpt": "Liz shares some of the common questions she's asked in Business Development at ustwo London.",
        "content": "<p>Liz shares some of the common questions she&#8217;s asked in Business Development at ustwo London.</p>\n<h3>“Can you give me a rough ball park cost and timings?”</h3>\n<p>It&#8217;s the question on everyone&#8217;s mind, but actually the most difficult to answer. This is especially true of product innovation projects, where we often don’t have insight into all the challenges or opportunities – at that stage we wouldn&#8217;t want to presume to know what the solution will be.</p>\n<p>That said, when you&#8217;re estimating, cost is determined by three interlinked factors. The scope of the work to be done, the time it will take to make what you need and, most importantly, your budget. We need to have detailed discussions to understand these variables before we can give you an accurate cost and approach that will suit your project and business.</p>\n<p>In most cases, one or more of these factors are fixed. If your budget is fixed, then it might be easier to start the discussion with ‘‘This is my ideal budget, what can I get for it?” as that will help us shape a plan where we can let you know how much time that will translate into and what scope can be achieved.</p>\n<h3>“How much will it cost to make me an app like Uber?”</h3>\n<p>These days everyone wants to get rich quick and be the next Uber or Tinder. It’s the modern-day success story and when you look at an ‘app’, it appears to be a simple thing. You just need to have that killer idea, get it built and then the million-dollar deal will follow, right? If only.</p>\n<p>Firstly, you need to stop thinking about it as an app and think about the whole product. A product needs a business model – how will it make money, and what is its value proposition?</p>\n<p>It needs to be promoted to help users find it. It needs a backend server and customer service support for when things go wrong. And the cost of building an app doesn’t end once it’s released. It’s a long-term investment that requires time, commitment and constant iteration to find that magic formula – aka product market fit.</p>\n<p>Let’s look at Uber as an example. Firstly, they weren’t strangers to the startup tech scene. One of the founders had already sold StumbleUpon to eBay so had a fair amount of seed capital to play with, and lots of friends in the tech scene. They had built some early prototypes and tested their idea with 3 cars in New York to validate their idea of an on-demand taxi service. Let’s take a guess and say they spent $250K of their own money on developing the business idea to this point.</p>\n<p>They then raised $1.3m in seed funding from a small group of investors to launch the service in San Francisco. Let&#8217;s assume they used this money to create the apps for iOS and Android, basic marketing, driver recruitment, customer service support and creating a back-end system to keep the whole system working &#8216;like magic’.</p>\n<p>A year later they raised $11m in Series A funding which they used to scale the service further to other cities. They’ve since gone on to raise a further $4.9 billion in funding. So the answer to the original question ‘How much will it cost to make an app like Uber’ is … a lot more than you think.</p>\n<p><img class=\"alignnone size-full wp-image-7298\" src=\"http://ustwo.com/wordpress/wp-content/uploads/2015/02/LIZ_02.gif\" alt=\"Animation sending back emails\" width=\"1200\" height=\"800\" /></p>\n<h3>“Can you build us a new product on iOS, Android and mobile web at the same time?”</h3>\n<p>Yes, of course we can. But do you really need it on all platforms to start with? While there will be some economies of scale in the design of a product, each platform has its quirks and needs a different development team.</p>\n<p>And once you’ve released the products, you’ll need to fix bugs and make improvements across each platform. All of which makes a multi-platform approach very expensive and potentially wasteful.</p>\n<p>We would always recommend that you start with one platform, test and learn on that and then grow to new platforms.</p>\n<p>Which platform you start with depends on your market, the users, the functionality and distribution that you need to leverage. A mobile web or hybrid app could be a good first option to validate a market demand, your proposition and pricing. They are easier to develop, easier to support and can reach the widest range of devices.</p>\n<p>But they lack access to the native features of a phone and gestural controls that users have come to expect. Native apps are more expensive to design and develop but provide the best overall user experience in terms of performance, functionality and look and feel.</p>\n<p>If you’ve validated your idea and are looking to launch a premium product then native is the way to go. The next question is, do you go with iOS or Android? That depends on your potential user base. Most new products are aimed at early adopters and our experience tells us that iOS is the best platform to reach this type of user.</p>\n<h3>“Can you make us a game/website/app to support a marketing campaign?”</h3>\n<p>Short answer, no. It’s not that we don’t like marketing, it’s just that it’s not what we do.</p>\n<p>Campaigns are designed to drive engagement or awareness with a brand, and an app or website as part of that mix is a communication channel that in most cases won’t have any long-term business value. There will be a fixed budget, a tight timeframe (we’ve all been there) and a concept that’s driven by an engagement mechanic or data collection.</p>\n<p>There are lots of studios who will happily build this type of app for you, but our focus is on creating products and services for the long-term that will make a genuine useful impact on user’s lives and build real business value.</p>\n<h3>“We’ve done all of the designs, can you just do the development?”</h3>\n<p>Doing all the design up front assumes that you know what the right design is and you just need to build it. This is a dangerous assumption to make and not an approach that we take, or recommend.</p>\n<p><img class=\"alignnone size-full wp-image-7299\" src=\"http://ustwo.com/wordpress/wp-content/uploads/2015/02/Emails-01.png\" alt=\"Cartoon of inbox\" width=\"5000\" height=\"3333\" /></p>\n<p>Our design process is a joint collaboration between design, tech, user and the business to ensure that all factors are aligned. While we do take on design-only projects and work with other developers as part of a collaborative team, we don’t provide development-only services if we’ve not had any involvement in the design.</p>\n<h3>“Would you consider a joint venture or revenue share?”</h3>\n<p>Now this is something we are interested in. But let’s get real. We’re not going to fund your ‘killer app idea’ or the next Instagram that you’ve dreamed up.</p>\n<p>We are interested in solving real business problems, disrupting existing markets and working with founders who have experience and credibility.</p>\n<p>That doesn’t mean we’re going to fund the entire thing, but we are open to other ways of getting paid for the value that we create.</p>\n<p>Revenue share or outcome-based models of engagement are extremely interesting to us as long as the risk/reward balance is right. We’re always open to discussing serious proposals along these lines.</p>\n",
        "date": "5 February 2015",
        "link": "/blog/how-much-will-it-cost-to-make-the-next-uber/",
        "category": "Business",
        "thumbnail": "http://ustwo.com/wordpress/wp-content/uploads/2015/02/LIZ_02.gif",
        "author": {
          "name": "Liz Whitney",
          "avatar": "<img alt='' src='http://0.gravatar.com/avatar/e4f3b20d7315a925bc5adf5b616cd8be?s=110&amp;d=http%3A%2F%2F0.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D110&amp;r=X' class='avatar avatar-110 photo' height='110' width='110' />",
          "description": "Liz is responsible for the business side of ustwo, ensuring we're working with new and interesting clients, advising on product and business strategy and keeping the London studio commercials ticking over nicely. She loves pitching (doesn't admit that freely though) and is pretty darn good at putting together a Keynote business proposal."
        },
        "comments": {
          "items": [
            {
              "author": {
                "name": "Paul",
                "email": "info@prismstudios.net",
                "avatar": "<img alt='' src='http://0.gravatar.com/avatar/ad516503a11cd5ca435acc9bb6523536?s=110' class='avatar avatar-110 photo avatar-default' height='110' width='110' />"
              },
              "content": "Excellent article! My thoughts exactly, only articulated much better than I could've.\r\n\r\nOne thing I would have to disagree with is the notion that making a hybrid mobile app is easier than native development. I guess that it depends on where your skills are, but as someone who has done both I don't believe hybrid mobile apps are easier. They are actually more difficult on many levels and really aren't a good place to start if you're creating a new app. \r\n\r\nChoosing native for one platform is definitely the way to go.\r\n\r\nMy 2 cents.",
              "date": "2015-02-06 21:15:45"
            },
            {
              "author": {
                "name": "Josh Brown",
                "email": "josh@roadfiresoftware.com",
                "avatar": "<img alt='' src='http://0.gravatar.com/avatar/ad516503a11cd5ca435acc9bb6523536?s=110' class='avatar avatar-110 photo avatar-default' height='110' width='110' />"
              },
              "content": "\"Doing all the design up front assumes that you know what the right design is and you just need to build it. This is a dangerous assumption to make and not an approach that we take, or recommend.\"\r\n\r\nAbsolutely agree. I've had so many people tell me they have the design and ask if I can build the app. Until now, I've never had a good answer. Now I can send them to your article. :) Thanks for writing!",
              "date": "2015-02-06 19:06:10"
            }
          ],
          "count": 2
        },
        "social": {
          "tweets": "105",
          "facebook": "72",
          "plus": "3",
          "total": 180
        },
        "layout": {
          "categoryClass": "business"
        },
        "extraClasses": ""
      },
      {
        "id": 7259,
        "title": "Dude, Where's My Car? A Conceptual Business Case for Zipcar ",
        "excerpt": "The world of wearables represents a considerable business opportunity to extend and augment the customer experience and make it even more useful, personal and profitable.",
        "content": "<p>Feeling enthusiastic after our <span style=\"text-decoration: underline;\"><a href=\"http://wear.ustwo.com/\" target=\"_blank\">initial foray</a></span> into the world of wearables with Google Wear, our attention turned to the horizon to see what lies in store for this exciting new piece of digital real estate.</p>\n<p>The wearables market, despite its infancy, has become saturated with a wide range of aesthetics and technologies, each seemingly geared towards satisfying the needs of early adopters.</p>\n<p>The spotlight has fallen recently on the new breed of smartwatches which present an evolution of the slew of devices that simply collect data about your activity, and now look to surface this information and much more via a screen on the wrist.</p>\n<p>We don’t expect smartwatches to be a flash in the pan – to ustwo, smartwatches signal the coming of age of the wearable device category. That said, there is way to go before this category matures and attains significant market penetration.</p>\n<p>The key to adoption of smartwatches lies not just in how it looks or how it feels, though these are huge factors. We believe <em>utility</em> is the cornerstone of the wearable experience.</p>\n<p>For us, that means surfacing useful, relevant content when the user needs it, with a clear response and feedback mechanism that is ‘glanceable’. This guiding principle was the foundation of our pioneering work on Google Wear.</p>\n<p><img class=\"alignnone size-full wp-image-7284\" src=\"http://ustwo.com/wordpress/wp-content/uploads/2015/02/collage-2.jpg\" alt=\"Sketches and mocked-up smartwatch screens\" width=\"1600\" height=\"1200\" /></p>\n<p>There’s a bit of behavioral economics behind this approach. People are used to, and even reliant on, their smartphones in their day-to-day lives. In order to create a behavioral shift, the smartwatch that sticks must deliver a new level of convenience, leading to user reliance.</p>\n<p>If a watch can provide real time contextual information, clearly and succinctly, the technology will arguably at times be more useful than the smartphone.</p>\n<p><strong>What we’ve done</strong></p>\n<p>Eager to explore what future experiences smartwatches could facilitate, we decided to invest some time scanning the horizon for opportunities during one of our Invent Time initiatives to create a concept for a future-looking smartwatch experience.</p>\n<p>When we began to look for ideas, one theme kept cropping up – mobility. Mobility plays a big part in determining quality of life in urban environments, as most city-dwellers will know.</p>\n<p>When considering companies that have revolutionised mobility recent years, <a href=\"http://www.zipcar.com/\" target=\"_blank\">Zipcar</a> was one of the first on the scene, and widely recognised as a catalyst of the sharing economy, and our favourite candidate for our smartchwatch concept.</p>\n<p>We started with a hypothesis:</p>\n<blockquote><p><em>Smartwatches can enhance the customer experience for Zipcar members</em></p>\n</blockquote>\n<p>We agreed to a two-week timeline and set off to define an end-to-end experience. We started with preliminary research into car sharing, car technology and the current capabilities of smartwatches and wearables. We also had a play around with the plethora of wearable tech that’s out there right now, to get a feel for the technology and what it can do for those who wear it.</p>\n<p><img class=\"alignnone size-full wp-image-7283\" src=\"http://ustwo.com/wordpress/wp-content/uploads/2015/02/exp_map1.jpg\" alt=\"experience mapping\" width=\"1600\" height=\"780\" /></p>\n<p>We went on to interview Zipcar users in the studio, to better understand their behaviors when using the service; everything from pre-planning, booking, managing their profile, to actually being on the road. Even amongst a small user set, we started to recognize consistent pain points and problems.</p>\n<p>We decided there was no better way to better understand these pain points ourselves than by booking our own Zipcar for a journey to Ikea in Red Hook, Brooklyn.</p>\n<p>Squeezed into a hatchback, our team made the 14 mile trip while fully documenting our own thoughts and feelings of the experience with Zipcar. We mapped out the end-to-end journey together, and placed a particular focus on the pain points highlighted by the customers we had interviewed, as well as the things that we thought already worked well.</p>\n<p>We identified a series of events and situations that smartwatches could facilitate. Armed with this knowledge we employed the design studio method of rapid concepting to help us create ideas that we could quickly refine and prototype.</p>\n<p><img class=\"alignnone size-full wp-image-7282\" src=\"http://ustwo.com/wordpress/wp-content/uploads/2015/02/05-Sketches4.jpg\" alt=\"Sketching protoypes\" width=\"1600\" height=\"1200\" /></p>\n<p>We made sure our ideas aligned with three main considerations, as to avoid creating a redundant or gimmicky smartwatch experience. These were:</p>\n<ul>\n<li>Does the app provide a useful service in specific situations where taking out a phone is impractical?</li>\n<li>Does the device show users something important that they’d miss if they didn’t take out their phones in time?</li>\n<li>Does the watch app save significant time without sacrificing significant functionality?</li>\n</ul>\n<p>Eventually, we created an end-to-end smartwatch experience for Zipcar we think satisfies that brief, and tied it all together with an interactive storyboard using <a href=\"http://timeline.knightlab.com/\" target=\"_blank\">Timeline.js</a> – a really useful framework for bringing concepts to life.</p>\n<p>You can take a look at our vision for how smartwatches can augment the Zipcar experience here:</p>\n<p><iframe src=\"http://cdn.knightlab.com/libs/timeline/latest/embed/index.html?source=0AgEOtxQl1QdOdFZqSVViVzIwZDk0OUdCNVkyckh5RXc&amp;font=Bevan-PotanoSans&amp;maptype=toner&amp;lang=en&amp;height=650\" width=\"100%\" height=\"650\" frameborder=\"0\"></iframe></p>\n<p>For companies with existing products and services, the world of wearables represents an opportunity to extend and augment the customer experience, making it even more useful, personal and, ultimately, profitable.</p>\n<p> </p>\n<h3>About the authors</h3>\n<p>This concept was conceived and developed over a period of 10 days by Hannah Nicdao, Leah Shea and David Fisher of the New York Design team. Our objectives during this project were to explore the use of aspects of <span style=\"text-decoration: underline;\"><a href=\"http://www.jeffgothelf.com/blog/lean-ux-book/\">Lean UX methodology </a></span>for rapid concept development, using new design tools (<span style=\"text-decoration: underline;\"><a href=\"http://bohemiancoding.com/sketch/\">Sketch</a></span>) and new ways to illustrate narratives (<span style=\"text-decoration: underline;\"><a href=\"http://timeline.knightlab.com/\">Timeline.js</a></span>). We did this under our Invent Time initiative – ustwo’s innovation program where we allocate a percentage of our time and resources to explore how we can tackle real world problems, try new ways of working, explore new tools and techniques and ultimately make a difference.</p>\n",
        "date": "2 February 2015",
        "link": "/blog/dude-wheres-my-car-a-conceptual-business-case-for-zipcar/",
        "category": "Design",
        "thumbnail": "http://ustwo.com/wordpress/wp-content/uploads/2015/02/IMG_1391.jpg",
        "author": {
          "name": "ustwo",
          "avatar": "<img alt='' src='http://0.gravatar.com/avatar/45f535a0b9bb437628b6f49a55536234?s=110&amp;d=http%3A%2F%2F0.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D110&amp;r=X' class='avatar avatar-110 photo' height='110' width='110' />",
          "description": "We're a global digital product studio dreaming and doing transformative client, own product and venture work."
        },
        "comments": {
          "items": [],
          "count": 0
        },
        "social": {
          "tweets": "39",
          "facebook": "31",
          "plus": "0",
          "total": 70
        },
        "layout": {
          "categoryClass": "design"
        },
        "extraClasses": ""
      },
      {
        "id": 7155,
        "title": "Free of Charge",
        "excerpt": "A look at the charging ecosystem for electric vehicles, and how it has affected their adoption in the UK",
        "content": "<p>For the benefit of people who don’t know a lot about Electric Vehicles (EVs), it’s fair to say that adoption in the UK so far has not been widespread. A <a href=\"https://www.gov.uk/government/uploads/system/uploads/attachment_data/file/321157/electric-vehicles-2014.pdf\" target=\"_blank\">survey</a> carried out in June 2014 by the Department of Transport found only 0.3 per cent were EV owners (sample of 962 people aged 16 and over across Great Britain). The two main concerns, or barriers to adoption, were recharging and the potential range of a charge.</p>\n<p>That said, there has been a big push from the government to increase EV adoption – benefits include a 5k subsidy, free road tax, congestion charge exemption and, at present, the vast majority of public charge points are free to use. </p>\n<p>I was keen to learn more about EV usage, and cycled to many charge points around central London, staking them out and waiting for people to come and charge so I could talk to them. I mostly found empty stations. I went further out, to find shopping centre car parks with long rows of charge stations, waiting patiently, as tumbleweed passed by &#8230;</p>\n<p><img class=\"alignnone size-full wp-image-7161\" src=\"http://ustwo.com/wordpress/wp-content/uploads/2015/01/empty-car-park-2.jpg\" alt=\"A row of empty car charge points\" width=\"1224\" height=\"886\" /></p>\n<h3>What we found</h3>\n<p>I quickly gathered that broken charge points are a big problem in London – I experienced this first-hand and confirmed it with numerous EV owners. One woman I interviewed had once been to 5 broken charger points in a row. This can be a hugely frustrating experience.</p>\n<p>Bad data is at the heart of this problem – many of these frustrations could be avoided if people knew not to travel to certain charge points when they were out of order.</p>\n<p>Journey-planning pains are also an issue for the less experienced EV drivers, although there will always be an in-car interactive centre console which, in theory, has the ability to get you to charging stations when needed, some car manufacturers align with certain networks and won’t display the other network’s charge points on their maps. The vast majority of people I spoke to did not rely on the in-car centre console, instead resorting to an app on their phones.</p>\n<p>The digital products being offered in this space at present are poor, with low quality and unreliable data a big part of it. To compound this, they often have huge usability issues. <a href=\"https://www.zap-map.com/\" target=\"_blank\">Zap Map</a>, which is probably one of the most popular products, is absolutely awful on mobile – the very context where it needs to be strongest.</p>\n<p>All these factors manifest on a human level, distorting public perception as it fans the flames of “range anxiety” and other negative and generally misconceived notions.</p>\n<p>A lack of faith from their customers in the charge networks is another side effect, with the exception of <a href=\"https://www.ecotricity.co.uk/\" target=\"_blank\">Ecotricity</a>, who enjoy more loyalty for providing a far more reliable service, offering pure green energy and commitment to a decent level of functionality and service.</p>\n<p>EV owners understand that a time will come when public charge points will cease to be free (it&#8217;s already happening), but they are not prepared to pay for a poor service as was demonstrated when Polar (owned by Chargemaster) launched their Pay per Charge app and hardware, and received <a href=\"https://speakev.com/threads/polar-instant-app-discussion-feedback.1674/\" target=\"_blank\">harsh criticism</a> from the EV community.</p>\n<p><img class=\"alignnone size-full wp-image-7162\" src=\"http://ustwo.com/wordpress/wp-content/uploads/2015/01/broken-charger-e1420623741190.jpg\" alt=\"People at a broken charger point\" width=\"1224\" height=\"1631\" /></p>\n<h3>New thinking</h3>\n<p>What if owning an EV allowed the same spontaneous behavior as normal vehicles, or finding somewhere to charge at any point in the journey wasn’t an issue? Imagine a system that did the heavy lifting for you, drawing in relevant data, creating an end-to-end experience that adapted to the context of your journey.</p>\n<p>This product/service could help drive adoption in the UK by removing the journey-related anxieties which exist today, simplifying the experience and building faith in both EVs and their charge networks.</p>\n<h3>Full tank?</h3>\n<p>Strangely enough, in the UK we usually measure fuel performance in imperial units (mpg) but buy fuel through metric units (litres). With this in mind how will people conceptualize the purchase of energy as a fuel for their vehicle?</p>\n<p>People are used to paying electricity bills, but does everyone understand what a kWh is, and how many their car needs to drive 50 miles?</p>\n<p>We need to drive widespread adoption in this country and the more approachable the system is, the more likely it will happen. As mobile phone usage continues to affect our lives perhaps battery %, as a concept, will trump everything else.</p>\n<p><img class=\"alignnone size-full wp-image-7163\" src=\"http://ustwo.com/wordpress/wp-content/uploads/2015/01/charging-screen.jpg\" alt=\"charging screen\" width=\"5184\" height=\"3456\" /></p>\n<h3>Pay for what?</h3>\n<p>The existing payment model in the UK is for time spent charging your vehicle, not the amount of energy your battery receives, which is completely arbitrary. Opinion is quite mixed within the EV community as to what the most logical or inclusive unit for payment is, some even go so far as to suggest a new metric all together, the E-litre which could simplify the complexity of the relationship between kWh, money, distance and petrol.</p>\n<p>My research indicated that the majority of EV owners thought that a straight price per kWh seems the most logical. From a design perspective, giving the user the ability to customize the information presented to them at point of purchase seems appropriate.</p>\n<h3>Correct etiquette</h3>\n<p>Charging etiquette is very important in the EV community and smart notifications could go a long way in promoting fair usage of charge points and preventing what is known as ‘charge rage’ (a state of rage induced by petrol vehicles parking in charge bays or other EV owners taking up charge bays when their car is full).</p>\n<p>The suggestion of an anonymous p2p messaging service has cropped up in a few places on our travels. Essentially a line of communication from someone waiting for a charge station to the owner of the vehicle in it. The notifications or “Bumps” could be pre-defined (“How long are you going to be?”) as the scope of communication should be limited.</p>\n<h3>The end of the road</h3>\n<p>What we refer to as the last mile is also a big consideration, it’s not necessarily just about getting you to a destination but also planning for the return journey. Perhaps you need a destination charge, you are attending a meeting that will last several hours, you shouldn’t block a fast charger, instead the system will guide you to a slow charge point and offer suitable options for the last leg.</p>\n<h3>Concept Video</h3>\n<p style=\"position: relative; padding-bottom: 56.25%; height: 0; overflow: hidden;\"><iframe style=\"position: absolute; top: 0; left: 0; width: 100%; height: 100%;\" src=\"//www.youtube.com/embed/WFCDbOY-ACA\" width=\"300\" height=\"150\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"></iframe></p>\n<h3>Last thoughts</h3>\n<p>It should be noted that, for day-to-day travel, some of this functionality may not be necessary, a lot of EV owners in London for instance recharge their cars in their own driveways, limiting the need to use public chargers.</p>\n<p>This is not always the case though, as proven by Sergio, a Spanish Doctor I met at a charging point. We got on well and I spent the afternoon driving around with him looking for a working charge station in north London. It was his day off and he had to make sure there was a full charge in the battery for his wife who was not a “true believer” in EVs as he was.</p>\n<p>This is an interesting space to watch – battery range is increasing, Tesla are set to bring out their more “affordable” Model 3 in 2017 and Ecotricity has put a robust network throughout the main roads of the UK. Having driven a few EVs at this point I definitely feel won over by them. I don’t need a car, living as I do in central London, but if I did I would probably get an EV.</p>\n<p>In the UK, right now, you charge your vehicle at any Ecotricity charge point and know that what you get is completely free and 100% green energy. I felt excited by this when I drove EVs, and it made me want take off on a road trip somewhere.</p>\n<p>What if we could make these feelings commonplace, by providing an intelligent, dynamic platform working across all the charge networks? Through good design we can remove existing barriers to adoption and drive behavioural change in this area.</p>\n<p>Saving money may be the most important factor when people choose to buy an EV, according to a recent <a href=\"https://speakev.com/threads/why-did-you-buy-or-are-you-thinking-of-buying-an-electric-car.45/page-3#post-19594\" target=\"_blank\">survey</a> (SpeakEV), but driving for the sheer pleasure comes in second.</p>\n<p>Fossil fuels are a finite resource and, despite recent price falls, driving for fun is rightly becoming a less realistic pastime. Might EVs, however, fill this potential transportational void?</p>\n",
        "date": "8 January 2015",
        "link": "/blog/free-of-charge/",
        "category": "UX",
        "thumbnail": "http://ustwo.com/wordpress/wp-content/uploads/2015/01/billy-cover-image.jpg",
        "author": {
          "name": "Billy",
          "avatar": "<img alt='' src='http://1.gravatar.com/avatar/7581f9d7df8bf80aff7a399c7f5e79ed?s=110&amp;d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D110&amp;r=X' class='avatar avatar-110 photo' height='110' width='110' />",
          "description": "Irish-born digital bozo. Interaction designer interested in people and places."
        },
        "comments": {
          "items": [],
          "count": 0
        },
        "social": {
          "tweets": "16",
          "facebook": "3",
          "plus": "0",
          "total": 19
        },
        "layout": {
          "categoryClass": "ux"
        },
        "extraClasses": ""
      },
      {
        "id": 6937,
        "title": "Should Apps Be More Like Teaspoons?",
        "excerpt": "When was the teaspoon invented? It was definitely before Spotify, probably before MySpace and maybe even before Yahoo...",
        "content": "<p>When was the teaspoon invented? It was definitely before Spotify, probably before MySpace and maybe even before Yahoo. Originating as an apothecaries&#8217; measure, best estimates of its evolution into a spoon for tea are around the year 1600. Over 400 years later, while they’ve increased in size teaspoons remain, in essence, the same object with the same function. </p>\n<p>Yet teaspoons are still actively designed even though there are thousands of variations already in existence. Some people will get rid of one set only to buy another, purely because they prefer the design. They’re rethought and reinvented in everything from bamboo to platinum. Existing designs are refined, older designs become collectable. Indeed, some teaspoons are designed specifically for collectors as those clutching Clacton-on-Sea souvenirs will attest. Why? Because there is a need involved, centred around an array of existing and seemingly unshakeable habits developed over hundreds of years. The aesthetics of desire are at work, too: our love of the designed object, our addiction to owning things; our delight at nuances and thoughtfulness, even playfulness. And crucially, although it may come as a revelation to some, they can also be used for coffee.</p>\n<p><img src=\"http://ustwo.com/wordpress/wp-content/uploads/2014/12/teaspoon-app.png\" alt=\"mock up of app store logo made with teaspoons\" width=\"512\" height=\"512\" class=\"alignnone size-full wp-image-7133\" /></p>\n<p>Sometimes it feels like the world of digital product design is surrounded by a thousand dogs chasing a thousand tails – not always their own – in search of the new. Ideas for apps are brainstormed, on average, over 16,000 times a day in Shoreditch alone (probably). Apps for measuring your burps, apps to compare shoes with people with the same name as you, apps to find lost mittens.</p>\n<p>Many of these seem to be hunting for a new need. But perhaps we&#8217;d all be better off trying to work out how to serve an existing need better, in a way that teams up with our tea cups and makes users want our products because they not only serve a useful function, but because they do it so damn beautifully. </p>\n<p>This post arose from a joke with design specialist Mette Andersen about how we could have a blog post about teaspoons as a metaphor (mettephor?). Be careful what you wish for at ustwo!</p>\n",
        "date": "19 December 2014",
        "link": "/blog/should-apps-be-more-like-teaspoons/",
        "category": "Design",
        "thumbnail": "http://ustwo.com/wordpress/wp-content/uploads/2014/12/4-Measuring-Spoons.jpg",
        "author": {
          "name": "alex.ustwo",
          "avatar": "<img alt='' src='http://1.gravatar.com/avatar/d208a52b85e3de21d3763829543618ec?s=110&amp;d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D110&amp;r=X' class='avatar avatar-110 photo' height='110' width='110' />",
          "description": "Alex has been designing for humans for over 20 years, with experience that spans visual design, branding, service and interaction design, plus teaching at BA level. He sometimes writes about subjects seriously. Oh, and his four albums under the name 'ollo' are available NOW!"
        },
        "comments": {
          "items": [],
          "count": 0
        },
        "social": {
          "tweets": "14",
          "facebook": "2",
          "plus": "1",
          "total": 17
        },
        "layout": {
          "categoryClass": "design"
        },
        "extraClasses": ""
      },
      {
        "id": 7030,
        "title": "hudl2 – Product and Brand, Hand in Hand",
        "excerpt": "The hudl2 proves that the digital experience of a mass market product can be developed in harmony with the brand and industrial design.",
        "content": "<p>At ustwo, we believe that today’s valuable brands are built from the product out. Classic brand thinking, from propositions to visual language, is based on the era of commodity products. But digital products are inherently different, when developed with user-centric methodologies. We expect coherence between all aspects of a brand – from the product itself to its packaging and marketing messages. Too often, however, client services projects are constructed in a waterfall-esque fashion, from research study, to brand partners and then over to product team to build out the proposition.</p>\n<p>Like many startups would, we approached Hudl as one team, with all specialisms and disciplines working together – a deep and true collaboration. This allowed us to create a more coherent and appropriate visual language and experience for our users, through testing and feedback, as well as the product offering itself, by keeping it aligned with the proposition at every touchpoint.  </p>\n<p><img src=\"http://ustwo.com/wordpress/wp-content/uploads/2014/12/hudl_hero_jack.png\" alt=\"A Tesco hudl2 tablet\" width=\"1920\" height=\"1335\" class=\"alignnone size-full wp-image-7035\" /></p>\n<p>The nature of developing a product, particularly when embracing Lean methodologies, means there are a lot of moving parts, and it’s only right that the visual language runs in parallel and adapts responsively. This allows us to consider the traits of multiple touchpoints through learning and iteration, driven by genuine user insight rather than proxy and post-rationalisation. In this approach the whole team and all the moving parts tighten and align sprint by sprint, day by day.</p>\n<p>When we delivered the project, ustwo had spent nine months designing four native apps (Top Apps, Get Started, Child Safety and a child-safe internet browser), a launcher app we call ‘My Tesco’ including a redesign of the homescreen environment, and various other touchpoints throughout the operating system as well as the in-store demo mode.</p>\n<p>The hudl2 project began with a fresh look at the brand, retaining only the name and logomark. As a result of this, the product team at ustwo helped lay new foundations through the interface and experience, which developed into the visual language of the brand through work with <a href=\"http://www.thechase.co.uk/\" target=\"_blank\">The Chase</a>. </p>\n<p>Various factors informed our development of the hudl2 design work: usage data, demographic analysis, industrial design, legacy brand design, how this sat alongside the mother brand Tesco and the Android Operating System (pre-material design). Harnessing data and insights gathered through feedback, testing and studies of the hudl1 allowed us to formulate a visual approach which best suited our key personas for the hudl2.</p>\n<p>hudl is an emerging brand – we express and celebrate ‘happy technology’ embracing all, from young to old, from tech-savvy to tech-laggard with a light humour. Part of our challenge was to create a unique brand personality whilst retaining vital credibility amongst the larger, more established Silicon Valley giants.</p>\n<p><img src=\"http://ustwo.com/wordpress/wp-content/uploads/2014/12/hudl_apps.png\" alt=\"variety of hudl2 apps\" width=\"1920\" height=\"1080\" class=\"alignnone size-full wp-image-7050\" /></p>\n<p>Lets dive-in to uncover some of the details and decisions surrounding this process.</p>\n<p>The hudl2 experience is about effortless family entertainment, enjoyment and productivity. We balanced a bold use of bright colour and playful shapes with controlled layout, typography and generous breathing space to achieve this equilibrium between playful and credible.</p>\n<p>The industrial design of the device was being developed in parallel with our work. We wanted to complement the industrial design in the elements we were creating for the interface experience, and drew inspiration from certain physical elements, such as the corner radii and colour use, to inform our work. The brand’s Pantone and hex values are an evolution on the eight colour finishes of the product with a few others carefully chosen to build it out into a wider spectrum for flexible use. The process of developing the colour palette was a collaborative effort between ustwo and The Chase to ensure quality with both digital and print, and accessibility considerations for on-screen purposes.</p>\n<p>Another example of the contribution towards this balanced look and feel is the use of &#8216;bloated&#8217; and curved lines seen on the exterior of the hudl icons (and illustrations) and the smart straight and geometric nature of the interior shapes. The bloating of the iconography actually originated from a cross-studio discussion surrounding the product&#8217;s physical form. In a discussion with <a href=\"http://carocommunications.com/clients/chauhanstudio/\" target=\"_blank\">Chauhan’s</a> Creative Director, we discussed how one of our icons was designed to resemble the device’s silhouette. His feedback highlighted a form factor intricacy, which we then took on board and exaggerated to form the basis of the bloated icon style. </p>\n<p><img src=\"http://ustwo.com/wordpress/wp-content/uploads/2014/12/huld_icons.png\" alt=\"icons for the hudl2\" width=\"1920\" height=\"1080\" class=\"alignnone size-full wp-image-7039\" /></p>\n<p>This constant, open and respectful dialogue between the three parties created a strong network dynamic and allowed us to share ideas and solve challenges together. We held workshops between all parties involved to openly discuss work in progress, not only to ensure alignment but also give everyone a voice, feel part of the process and contribute towards our collective direction and vision. You can read more about the collaboration and process in <a href=\"http://ustwo.com/blog/collaboration-and-the-hudl2/\" target=\"_blank\">Collin’s post</a>.</p>\n<p>As the three core native apps (Get Started, Top Apps and Child Safety) were built alongside each other, we had the opportunity to investigate shared qualities and patterns for consistency and usability. The result was a consistent area for introducing or communicating section-specific content along the top of each home screen, and the provision of an appropriate space in which to reinforce the app’s core colour and illustrative elements. This continued through to the detail pages of the apps, where a larger area is used to surface photography and imagery related to the topic or category in hand.</p>\n<p>To prepare and excite the user, the primary uses of the device (ie Watching, Gaming, Reading) were illustrated via a transformational icon animation on boot up and in store (via the demo mode). ustwo also created the first time experience video, the end note of the setup journey signposting the key features and apps.</p>\n<p>The Android launcher (Homescreen environment) presents a cluttered and suboptimal grid layout by default on the hudl2, and, as we know, first impressions are vital. For this reason we spent time and effort in crafting a home screen experience that was optimal in terms of content density, clarity, legibility and layout with first time and repeated use in mind. The grid in which the apps sit also has to be able host widgets, for which we designed two, both of which had large image areas designed to contain multiple media types and showcase third party apps effectively. The chromeless widgets are designed to blend in with the necessary furniture on the homescreen, provide a seamless entry point to the hudl apps and coincide with the My Tesco look and feel.</p>\n<div id=\"attachment_7037\" style=\"width: 1930px\" class=\"wp-caption alignnone\"><img src=\"http://ustwo.com/wordpress/wp-content/uploads/2014/12/launcher_build.gif\" alt=\"Animation showing the construction of the launcher layout\" width=\"1920\" height=\"1200\" class=\"size-full wp-image-7037\" /><p class=\"wp-caption-text\">Construction of the launcher layout.</p></div>\n<p>The presence of Tesco within the user experience was something we worked hard to get just right. Through user testing and brand presence and perception testing we have arrived at a place where both customer and client are happy, which is a great achievement. In order for a Tesco consumer to perform an array of actions such as adding groceries to their shopping basket, finding their nearest store and discovering new offers available from sub-brands such as F&#038;F all of the Tesco services can be accessed from a left swipe on the home screen. </p>\n<p><img src=\"http://ustwo.com/wordpress/wp-content/uploads/2014/12/hudl_my_tesco.png\" alt=\"Shows tesco hudl2 screen\" width=\"1920\" height=\"1200\" class=\"alignnone size-full wp-image-7047\" /></p>\n<p>Having the Tesco content here means that it doesn’t impede on the experience a user should expect from an Android tablet whilst keeping it highly accessible. In order to visually integrate this dedicated Tesco area with the hudl tablet experience, we did several things. To create a personalised and seamless feeling we blurred the user&#8217;s home screen wallpaper behind the content, and supported this transition with some animated touches such as the ‘Tesco’ wordmark building out from the ‘T’ access point on the homescreen. </p>\n<p>To conclude, the hudl2 proves that the digital experience of a mass market product can be developed in harmony with the brand and industrial design through open communication and collaboration. An approach obsessed with user value and learning across the entire team and family of stakeholders to drive objective and informed decisions. Differentiated products require bravery and a learning mindset to ensure that by launch day you’ve made the right thing in the right way. It requires cutting away any superfluous messaging or semiotics that aren&#8217;t evident in the product itself, keeping the user&#8217;s perception and experience of the product tightly focused. Tied with an accessible price tag, the results have created great value for both hudl owners and our client’s brand.   </p>\n",
        "date": "18 December 2014",
        "link": "/blog/hudl2-product-and-brand-hand-in-hand/",
        "category": "Design",
        "thumbnail": "http://ustwo.com/wordpress/wp-content/uploads/2014/12/hudl_hero_jack.png",
        "author": {
          "name": "jack.ustwo",
          "avatar": "<img alt='' src='http://0.gravatar.com/avatar/a4ed447dd0ec78e8cc3f2930716e9991?s=110&amp;d=http%3A%2F%2F0.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D110&amp;r=X' class='avatar avatar-110 photo' height='110' width='110' />",
          "description": "A country bumpkin at heart, and with a decade of design under his belt, Jack is a product designer driven by providing smart solutions to new challenges and bad puns to a good team. Soon off to sunnier climes to begin a new adventure with ustwo Sydney."
        },
        "comments": {
          "items": [],
          "count": 0
        },
        "social": {
          "tweets": "8",
          "facebook": "2",
          "plus": "0",
          "total": 10
        },
        "layout": {
          "categoryClass": "design"
        },
        "extraClasses": ""
      }
    ],
    "number": "95"
  },
  "searchString": "Search"
}
