{
  "title": "ustwo",
  "colours": {
    "piglet"            :"#ED0082",
    "softPiglet"        :"#FFA5BE",
    "passion"           :"#E60C29",
    "softPassion"       :"#FA7D78",
    "ohra"              :"#FF5519",
    "honey"             :"#FFBF02",
    "softHoney"         :"#F5E664",
    "jeezz"             :"#96CC29",
    "pot"               :"#14C04D",
    "softPot"           :"#A5FAAF",
    "mare"              :"#16D6D9",
    "softMare"          :"#A5FAFA",
    "blu"               :"#009CF3",
    "navy"              :"#143FCC",
    "rain"              :"#6114CC",
    "four"              :"#171D27",
    "white"             :"#FFFFFF",
    "grey"              :"#212121",
    "nonBlack"          :"#333333",
    "landingOrange"     :"#FF4F2D",
    "midGrey"           :"#BFBFBF",
    "paleGrey"          :"#DFDFDF",
    "pale-turquoise"    :"#7ECACA",
    "pink"              :"#DF498C",
    "new-blue"          :"#28A9E2"
  },
  "post": {
    "id": 3286,
    "title": "MIDI controller to Philips Hue",
    "excerpt": "We're kicking off a series of posts about hardware, sensors, Arduino, Internet of Things... and for starters… we’re connecting a MIDI controller to a set of Philips Hue lights.",
    "content": "<p>We believe that in the not so distant future, simple everyday household objects will become part of a network of connected devices. Each device will communicate and work together to help us all live our lives more efficiently.</p><p><p>The hardware needed is already available at reasonable prices and will only get cheaper. Also a bunch of Open Software and Open Hardware platforms (Arduino, Ninja Blocks, Raspberry Pi, Teagueduino, BeagleBone&#8230;) have opened up the world of hardware development, so people like us (developers and designers) can get stuck in and bring a completely different mindset to the development process &#8211; a mindset centred around users.</p><p><p>We still have loads to learn, but we’re getting there. Have a look at the video below of our latest prototype that we&#8217;ve put together:</p><p><iframe src=\"http://player.vimeo.com/video/60646179\" width=\"500\" height=\"281\" frameborder=\"0\" webkitAllowFullScreen mozallowfullscreen allowFullScreen></iframe> <p>What you see is a combination of these:</p><p><p><strong>Philips Hue lights</strong></p><p><p>We bought these from a recent trip to our newly opened NY studio. The <a href=\"http://www.meethue.com/\">Philips Hue</a> is set of LED lights that you can control the colour of by using its official app (<a href=\"https://itunes.apple.com/gb/app/philips-hue/id557206189?mt=8\">iPhone</a>, <a href=\"https://play.google.com/store/apps/details?id=com.philips.lighting.hue&amp;hl=en\">Android</a>).</p><p><p>It didn’t take long for the community to figure out <a href=\"http://rsmck.co.uk/hue\">how to control them</a>, which as it turns out is very simple to do through HTTP requests. In a clever, yet surprising decision for a big company, Philips decided not to lock down the hub or sue 3rd party developers. More so, it seems that the engineers at Philips either run or are very active in the <a href=\"http://www.everyhue.com/\">unofficial support forums</a>.</p><p><p><strong>Behringer BCD3000 MIDI controller</strong></p><p><p>Oldie but goodie, we typically use it for our DJ sessions in the London studio, but we thought it would be cool to use it to control the lights as well.</p><p><p>To make things simpler, Behringer offers <a href=\"http://www.behringer.com/EN/Products/BCD3000.aspx\">decent documentation on their website</a>.</p><p><p><strong>UniMIDI</strong></p><p><p>This is a fully <a href=\"https://github.com/arirusso/unimidi\">cross-platform Ruby library to handle MIDI devices</a>. Was refreshing to get it to work in Ubuntu without almost any trouble (we reported a potential <a href=\"https://github.com/arirusso/alsa-rawmidi/issues/2\">issue regarding high CPU usage</a>).</p><p><p>It had no trouble getting data from the Behringer and also from other MIDI devices that we have knocking around the studio, like the <a href=\"http://global.novationmusic.com/midi-controllers-digital-dj/launchpad\">Novation Launchpad</a>.</p><p><p>The only thing we couldn’t figure out was how to send commands to the controller, for example, to turn on its LEDs. Too bad we ran out of time!</p><p><p><strong>RubyHue</strong></p><p><p>We used <a href=\"https://github.com/AaronH/RubyHue\">RubyHue</a> to talk to the Hue, which was good enough for this prototype, but we later found a <a href=\"https://github.com/birkirb/hue-lib\">more polished fork</a>. As of today, neither library handles groups of lights, which might be a very important feature in future (read caveats below).</p><p><p><strong>Caveats</strong></p><p><p>The Philips Hue is a system designed for the house to help achieve a nice and warm range of coloured lighting and good radio coverage (using <a href=\"http://www.everyhue.com/vanilla/discussion/comment/1018#Comment_1018\">ZigBee’s mesh effect</a>).</p><p><p>The downside to this is it’s very difficult to get colour changes occurring rapidly even with transition set to 0, especially on a busy network (you talk to the hub via HTTP calls) or with a high number of lights (~10).</p><p><p>This could be overcome by using the <a href=\"http://www.everyhue.com/vanilla/discussion/57/api-groups\">groups API</a>, but most libraries don’t cover it yet.</p><p><p>Philips has not released the official SDK, which means it would be very risky basing a commercial product around it.</p><p><p>//</p><p><p>Anyway.</p><p><p>Although this was a proof of concept, we’ve learned a lot from it and if you’re interested in the code, you can check it out on <a href=\"https://github.com/ustwo/midi-to-philips-hue\">Github</a>.</p><p><p>We’re not sure what we’re going to do with the Hue, since we have other numerous ideas for other internal projects that could use a set of programmable lights.</p><p><p>By the way, we’re going to be testing (and blogging about) hardware a lot during 2013. We’re super interested in all the new emerging platforms and the almost endless possibilities and opportunities they will offer. Anyone sharing similar interests or with similar stories, please get in touch (juan __ ustwo __ co __ uk) or leave a comment!</p><p><p>Thanks : )</p><p><p>PS: credits to <a href=\"https://twitter.com/alvaroarregui\">Alvaro Arregui</a> for the video edit and <a href=\"https://soundcloud.com/elkiano\">elkiano</a> for the soundtrack!</p>",
    "date": "1 March 2013",
    "link": "http://ustwo.com/blog/midi-controller-to-philips-hue/",
    "category": "Development",
    "thumbnail": "http://ustwo.com/wordpress/wp-content/uploads/2014/01/Screen-Shot-2014-01-28-at-1.49.07-PM.png",
    "author": {
      "name": "Juan",
      "avatar": "<img alt='' src='http://1.gravatar.com/avatar/d5a3b89f816b32d2a430abb889fecf57?s=110&amp;d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D110&amp;r=X' class='avatar avatar-110 photo' height='110' width='110' />",
      "description": "I've spent the last 10 years making things happen on screens for web, mobile or TV. However, my developer persona is just a cover up until I make it as a world class minimal-techno DJ."
    },
    "comments": {
      "items": [],
      "count": 0
    },
    "social": {
      "tweets": "13",
      "facebook": "1",
      "plus": "1",
      "total": 15
    },
    "layout": {
      "categoryClass": "development"
    }
  }
}
